node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 9
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 9
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\t\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected/weights"
  input: "global_square/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/weights/read"
  op: "Identity"
  input: "global_square/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_square/fully_connected/biases"
  input: "global_square/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/biases/read"
  op: "Identity"
  input: "global_square/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/MatMul"
  op: "MatMul"
  input: "global_square/Placeholder"
  input: "global_square/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_square/fully_connected/MatMul"
  input: "global_square/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_square/fully_connected/Relu"
  op: "Relu"
  input: "global_square/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\3701g\272\275tJ\272Z0\3708\300\255\2177\005U\252:\230\276\010\271]B\206\272\224\2278:t\3753:o\2433:\304\352t\272\247\320>:\022\t\247\272Cr\232\272\263\206\023:\253\353\003:r\303\312\271!\010\003:\314\004\3739L\220\005;J\262Q\272M\"\033\272\017\tV\272\272hu\272\336\203\253\271^A*2r]\2659\341\210\030:\312\024\2239x\035[:\361\304v89\212\2269\t\265=\272\354U\307\271\346\221k\272\021\227\34484\267\370\271nZ\0318\033f\217:8H\020\2722\272\364\272GX\000:Y,\007:\0160b\272\017\312\3479\216\201,:\370\314k\270w\373 \272q\362\3629S\301\0379\257\31059,~\273\271\010\r\032\271\000\334\3656\273\264\3627\013\005\000\272\207=\342\270\346f+\272\\\310\327:\236\321\010\273\322\003\0349\033\024\2558F\207\017\272\351\226\243:\223\037(\272Fv%\271N\241\022:\342\301/\271\205\341\231\272\2725\362\270\265\027t:}j*:\335\263j\272\027\037\261:sN\240\272b\267Y:Y\001\247:\374\001\214\272<\21219?\231\210\272\275[\376\271\364g\252:r\322\332\272%\236\235\272\354\003\013:\233\007\3739\231r\013\270^\332/9\3069\3309\371\231\035:\350$9\272\261\256\301:\232\337\367:\303A7\272\'\227\214\272\330}\311\271]tm:K\264\234:\1773\301\272%bU\272\326\346\223:{\326\214\272\346\001+\272\245\250\236\272H\257\2368YW-:\300\034\216\271l\023\263\271\333\256\206:\306e\025\272hp\2248\307\367r9\242\244x\272\270\251\3559xv\0028\205\350U:\322\376\263\272\212\273v\270\220\221\335\271\325\220\2459\n\366\347\272\325\224)\2724c\2459d6\264\271\300?\230\271\357\006\3139\353;}9\224\343\001\2739\221\27499\335\2369\021}Z:\355\020\000\272\n\217\203\271)@{: \345)\271%\246E\2726\261\261:\277\372\036\271Hf\0328Bg\004\272\351\364R\272\353.=\2724`\207\272^$\212\270\375t\3768\245\303\227:\253\026\274\272\r\\\3768\230\272t\271Q\262\216\2715\336z\272\022^\267\271\232\257#\270ZLo\2727\232\2179\231\177C\272f*\230\270\314P\251\2717\227\225\271}\345\335\272%]?\272\315o::^S\007\272@\263.\272\222\027\2569\322\360\000\272!WA\272\2140\2769,\264\203:VX\3428X\031\3217\364\225\2569\016\'\256:\321Z\n\272\303\362\'\272\377\320,\271D}\215:\245u\0339J\3149\2722\337\241:\342k\371\271\236\337\034:\213\341I:\002\026\220:\016\314\231:b\326\001\272&\030g:O\274\317\270u\354O:}\346\022\270\2130o7\2260\237\271\341\243\241\271\027y[\272\374\333\326:\326\327\0329\203\2756\271\327;\274\272+k\3109I\332I9u\221\204:\225\201\201\272\263&}:-\227+\272\301\242\":\335B&9\034\035\3766Y\274\033\272=\255\035:l\353%:\277\213%:\023\362T9j\027\235\272\r\203\364\270\002t\310\271u\335\027\272y>\250:S^0\270g\324P:\347\377E\272\204\005\221\272F\247+:\270\242\n\272\007i\233:-\342\2208Y:\261:\tc/\272\302\276;:8\332\322:4\214\330:w\024l\270\214\366F9\362\334\327:\024\363\343\27003\000\273\306\310\275\271G\'\030:Pg$:fJ7\2724\217\024\272$X\221\271x\205Z:FI\017:\342.\031\270\222@\002:H\237\013\271\273\"\2129&I\202\272\264h\3109\324y\014\273\356\305\231\272\304\354\253\272\252%I:W\320\343:\273U\3579b\r\027:S\002\014\272\2407\261:?\201\3549\t\224S\271\332\224\2618{%\263:\231x\036:\312\273\201:l\202\347\272.\027\254:\256Fl\272,\261w:\2746]\272\344\306\3579}^\236\272x4\230\271\r\252\244:\267\2457\271\177I\202\270\000[\3679\372\243B9\203Y\3509\036\305O\272\321\242*\272\227K\214:yd0\272-\350D:\033<\2609\241\316C:\n~\314:\277\367\002:\362\305`\272)\234^:\033\244\3269\332o\365\271\274D\265\271\204\307>9so\3739g\204\0256\240\232\233\272\260\240}9K\214.:+\301\2358\320\026\201\272\377\325\272\271<\034\254:.\350\335\272\007\241\274\270Z\311\004\272\250\251D\272\365EP9\002.\3349\024\333\3079\200\013\256\272\331\317\014\272;\337\020:\3718\251\271\\\370M9\032\3100\271\352\304\026\271\363|\005\271\254\251\002\272%\024~\272+[\255:\204\305\007;\231\344\0079\233\336[:\360\215\016\272\232-$\267\346\337\025\272\325\"\310\267\375\344!8\334\'-\272\335\253\241\272fE\236\272\312\351\214\270\252\207\032\272\375\020\225:f\377\266\272\215\267\3269k\233\342\272\220\326\016:\270\360\355\270\260R\005:t\316\3379\304\247T\272ca\242\270\300~d\271\373^\031\272\031\220\3738\265\3756:iS\027\273\335\034:9\2363\240:e.\2248\220\311\013;\303I\342\272=\351~\271<<\237:d\373\256\272J\3412\272\305uc8\036L&\271\'f\2169c\251\027\272\212\216\3619\3316t:\233\352;\272XU\000:Qg\017\272\366\353X:b\220\\:\302\033\212:Z\001\032:E\312\3309\3475U\272\215\010;:b\016H7\201\320\023:\327\010\376\271**\2768Q\020\250\270>\037 \266o\013\252\270f\007\2459\264\233O\270H\213\266:\02758\272\311\374\020\272k_\247\272\322\'\2068\026\313\376\271R\335H7:\013\2259\376h\037\272\220\374\3729w\264o\272\276j\034:K\333\013\271\250\372\004\270\217\023W:\340\242\3649wf\213\267\244\201\220\271Mx\007\2723\t\312\272f\333\316\271e\253\350:\026\266I\271\353h\033\270{\271\2769!aM:\027\341\r\266\333\326\277:\204\t\252\271\343G\263\272\322\035Q:z\304\"\271 I\034\272c\221\3509/\365\2609Y\3122\270\366\225\214:8\223,9#\270M:\202\223\022\272\341-\336\270A\337\272\271\273,y:\"\352\2069,;\2709.\024\326\271hF\276:\211\021m9\254,\232:S\035\250:\346\323z:\"D1:\350\277\233\272\314Qr\272\n\332{:=\016W:G\216\222\271\024\217\372\271\263\324\214:=\274\01491\242\2569\230~\224\270$=(\271\214\256}:\r@\201:\000\356B8\027\211\002:O(\216:#\005u\2726sC:\273\276\':\342\237\n;Y\221\343:\227\317\030:\353\240\333\270\021\212r:\014\342\300\272\005\202\242\271p\353\223\271\231\355\313\271uk{9j\3609\271z\357\022\271\n\007\206:\272<\231:\017Wf\272L\006\365\271\260\000+:-\014+:\034\253\206\270\316\215h:\350H\2619\016}y9\321\262a9\371\242\251\271\304uR\2724\273\212:A\345}\272.\255\347\271\010\2661\272/L\350\272\375\031\377\271\202\251~\271\341\223}:\315H\234:\000\276\202\272:Y\234\2707j\033\271\252w\205\272\277\371\342\271\323\300\2736\327\257\262:\334\223\2457\317\250n:*d\357\270 \n\023:+\237-:\013\372i9\003%\205\272N8q9\335AE:\010\020\030:3\241\206\272\022\262\350\271\323\246\33490\365@\272\331\211\2049\235\243t:vcv:\373\345x\270b0\007\272\002\014\37181\255b7,\031\266\272K\365\232\270\233\345d\2710qK\272J\256~9\353\014\2339\007d\034:%t\213\272Z\037\0068\036(\362\271\320\253F:\367a\3119v8\367\271\306\226G\272\257\346\3719)\203\335\272x\220\0139\211\303\3028\274\270c\272+\371c9\204\223\004\273\270\226j:s\251\224\272\017\000\006\271\tW\222\272\306\037,:C\332\t\272\331\343r\2712)\':*E(\272k\341\0208^\370\245:\210\274\261:\032\0018:\330[\345\271W~_\272h\331\214:\234\010\2159M\037>\272[\322\003:g\202\223\271\353\331\334:=\260\3169\247\311\243\271\323\274\245\2729\342\214\271e\252\013\272\375\301\2349\327\306\025\272\320\271\217\2676\325X\271\201m\t:B\356\3008\367\20079\322\367+\273\276\363\335:\326\230\374\271\261)\205:\315@\020\271\354\310\207:W\016\364\272\306\374\234\272\337\025\007;0\3005:!\352|\272E\001\335\270\007\215\0328Y50:\007\213\2779\275\315\221\272\251\020L\272\346]\200:\340\003,\272k\305\200\2719Dd\271\204(\020\273\2047S9\367>\225\272\021\205\236:\370\211>:\201\355\003\270\273\222\216\272\227\003\3229j\177\r:\017\353e\270"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_1/weights"
  input: "global_square/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_square/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
        tensor_content: "\241\341\230=6;\326\275\247\357M\275L\354&\275\377X\236\275f\265\300\275\024\243\332\274\026hW>\356\"\300\275\235\264s=<\304\331\274\005\316(=r\257\312\273e\203s\274\223\237\237\275SK\233\275\206G\230=\032\253\230=\206M\341\275d\230\224\275V\252 \275S\341\225\275\017\213\220=\220a\021>T\377\226\274j\306\277<\317XN\276\004\370o=\355_\366=\030\320\235=\310\344\004\276\3175\254\275\330\363\020=<\035C=\314\366\031\276\317\350\317<\337\270\342<\222P\001=\025\255\037\276\213D\251=B\323\343=\276Z|=\032\000\"=\256\213\315\275\330.\333\274\245>\317=\272j?\274l-\240\274\001\021\255<\210\255 =*\377\346=\3726\323\275us\221\274\232\031\231=\230r\331=\205\332\223<\3102I\275\346\305\215\275>8\027=\337\0377\275\353\030\357<id\364;vv\216\275_,q\275\nbq=\365&\035\275\271\255<<w\333\252\275X\203\366\275\010\263\206=\350T\357<\331\211\240=\253\010L>\236\0201\276\3101\246\274+z\240=\242\333\032\276\312\027\243=\306-\313=\3130;\276Oj\235\274\262\020\317=\314mE=\025\304\310=\304\017)\275e\367\342\274<\350\020\276\250\203\025> \234\342\274\303\305\\\275R/\"<$$\346:S\274c\275[\252\230<aU\273=\242\013j=\221\321q=9\'\032=\014\352\002\276\340\231$>\344\232\221\274\262\r\021; \321\375\274\257r\325<R\316J\275Z\206G\275ehj\274\006J?=\265_\302=\250\372\274=\343.\322=\210\357W\275\236\342\306\274\355C\253=\207\033\362\274\032*\027\2763\225\264=Y\272U\275M<\355\275\370\223\357<-D\314<\256\334\245=\004\207-\276\"\034a\274\311\001\315\275@\250@=\023\353w=x\311\217<Z6\220\275\034^\020=\323\351y\274<\316\237=\372\024\277\274H[.\2766\037p\274\234H=\275\207_\020\275\263\220(=c\345{<\346\314\275\272#\212\221\274\nm\225=\325\000\344=>K\270=\313\266\206<\270\001\301\273\346\035B\273\376\313\220\275\306\367>\276#\344\035\275"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_2/weights"
  input: "global_square/fully_connected_2/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 11
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\013\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/weights"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/biases"
  input: "global_circle/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/read"
  op: "Identity"
  input: "global_circle/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/MatMul"
  op: "MatMul"
  input: "global_circle/Placeholder"
  input: "global_circle/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_circle/fully_connected/MatMul"
  input: "global_circle/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_circle/fully_connected/Relu"
  op: "Relu"
  input: "global_circle/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "_\222\2079\006-S\272\216\207\244:\037\316g:\323\330\241\272\244s\340\270I\200\347:\337\273\277:\000\201\027\272\030\021R\272\032\235C:?w\002\272\207\362\3529 L\3639\323\r\3107.\345l8\022\224\2319\251\371\3518\2478,:t`G\272\337\226\310\272y\352\014\272\017\321z:\267E\002:\305(G\2715<\316:\034\305\300\272\037\353\004\272\213\327\213:lS\002:\254\207\3307\222\211\303\272\2357a:\021]\3769\331R\320:9\376\311\272\325\377\212\271\350\221\333\272\316\360\303\272\225},\272\235nb9\210x\024:\235\230\274\271O\301\267\270\005\320\366\271\277\224\027\272\2131\333\2705\250\274:@21\271;(U\271S:N\272i\250Y9\305\354\220:\276Q\377\271\317\3574\267v\026X\272\353\034J7E\232\262\272%\305\025:\240\377\2169\022\346j\272\364\036\2278\210?\2467\226e\325:\317={\271\366Q\2439\257\322\350:\007\327\033\272j\030\203:E\376\255\267\233\270N\272\305{H:\232\005\315\271\276\314\301\271\227\243\307\267\217s\224:+\331\257:\n\345\205\272\315\337F\272v\0014\271h\034\235\270!\272d9f\256\207:W\331\233\272\245\346y\272!\256/:\234\230l:v\255\273\271\2126k\271-\033\0059m\203;\272\002X\2339J\024\241\27225\265\271)F\3109\375\253\237\272|v,\272\314\214\370\271\036x\226\272\211\005\274\271YJ;\272\360Q\2719\032d\251\270\332\301\3359I3/\272\245\266N\271\214\026\3339\311\275=\272\031\033\034\272S\361\242:H\315\325\272\366T\255:\363\371N:e\271\3519\2727\2359p\212\322\272\010\026\264\272\017\356\':\265s\210:5\311\225\272,b\3428|av9\354i;9_\233\007:\335y\327:\222T\3267n`\007\272M\360\357\271:O\324\272\376\221\026;\264`\2109\345\026\007\272E\263K:wt\3739X\006\260:@{\370:\355\344{:\027Jp\272\341\312\220\272\034\"D:T\370\3679\356\256\2629\205y\000\272+\307\3529\217\271\223\272\376\267\203:r/\3429\204\213\3009d\243\023:-\217\266:\201u<\272\351\250C\271\315\327!:u\215\003\273\320#\300\271\313\032\\\271\2633\020:\373\347y:\305\357$\272n\301t9\247WP:\tBA:K\235\304:$9\222\272o\024\331\272\360\035W\272\301\245\310\271\227\241\2549\301\313\322\271\253\335k8\350b\212\271\371\336\310\267\320\037\252\272f\027.\272fFi\272\302M\004\272\323\336R:=Z\3409\265\001\251\271\303\362\2139\202&\":G=\024\271tr\024\272Tw?:\363\344\030\272\270=\21098\3132:\020\203\3519\350\340\2079\211(\305\271\257\377\022\272g\223\237:\332*\202\272\201\235\004:~\001\324:\350\001\201\271\345\n\001\272\230\226=\271\014m>:\202\261\232:\321z\333\270,\3125:l\322\030;\312`\235\272\364U\3339a\334+\271G\3527:\202\036\3069<1/9\245fZ:\202\240[:4l\273\272\200\037c9\334\373\374\272\327\016V\272L\221\":\030.\213\272\337\256\345\271\353\247p9\362\342+\272\030\353\301:^\035\324\272\357\344\233\271}(\210\272\202\026U\272\350\006\005;\317\334\346\271\013\244\027;\030U\r:\272\3572\271\214\237\005\272\010\322w9\003[#:\320d\315\271\233\316f\271Z\320L\2704\241.;\210%\004:\250?\214\272f\331\3139\227\225\234:~\270\"\272\356\326\306\271\325\315^:\343,\363\272\377\002\231\271\265\320\3519,?\324\272\313\033q:\350ra\272g$Q:\266\341\220\271\312\275D:k\334U:\255\324Q\271.\213\252:\006\357(\272\026\'\321\2729go9\217\0246:S\224\331\271\225\223\217\271^_\"\271m\335\226\272\325\0361\2725\267\3748=\333\363\271<L\227\271\214\\}9\377\036\240\2724\326G\272k\342t9\310\273.:\232\3241:\022a\250:\026,\214:\350\212T\271\247z)\272\322\021W\271\006\377\3479\245\234\346\271\206\254\274:\017\215\224\271\270MO\270\027\317\306\272\365\274\2368\3170\306:<\374\007\272\2325v9\363\314|\270\237\356z\271\035\321,\272\262\255h8\225\314\316\272W@\243\271\021U{:\2615\224:\345\243\027\27186\000\270\342\354\2127\021\327\324\271X\345\302\271K \013\273U\024\205\267\252\373\227\271\266\210\27390*\'\272\362\003\014\272;-\2479}Nm\271\211\341\3538\251(\2248\365\006i\272\214\247\220:\337\000,\272M\225S9\023ot\271\203\257K9\235\213\357:[\317/:F\260\225:9\016\263\271,\327\3209\363\375P\272&\207\n6\260\r\322\272\247=\016\272\004\274\315\272\371\320w\270\325\326C:\372\262J:J+\214:\210\2665\272vQ\211\270\006p\34693\226\223\272\372\333\0049\224|\212\272\254\363\035\272\362\362\273\270\262\327_:\350\035\022\271\302z;9\320$\205\271G`Q\271\231c)\272p\021!\272\345\036\2059/#\034:\225\027\027\272\246\214\031\273.\177\261\2719\035\301\271wQ\336\272/j\352:U\346\270:\374\334\032:\2605\n\272\321N\227\271Gb\201\272\340\262T:\214\322\0249d}\257\272\345\206\255\272\202\302\007:\245\273\207\272S\320Y:$\224I:C^\t:\035#\022\273\262\341\3509p\362\3619\002\202\2759\002&W:AS\366\271\200\r\005\272\266\267\2579\304<\2059A6\023\272\264&P\272<\313\2549\361 \2039\024\325s:\252$\374\271\322\355#\270.\204\323:\272\263\222\271o^\220\271\350\245\2149\364\244\223:L\221\371\271\336\326\177\272R\032\37085\354j9B\271%:RL\"9\273\'\2439Ks\3609\363<\023::/\354\271\362\334y:%\351\3436v\340\3668\253\021u:\273\000q:\236y\206\271\236S\3459!\376V:4\302\"\271\022C\345\272\223\264?\272\216\215\255\272YZ\026\272x\274<\272q\323\302\271:|V\2721L\026\272\243\274E:Q\303\2319\334\230\374\271\223&\215\271p \2509\313\260\334\271\300\321O\272P\022\3718 \343\3459\357\2069:\214\002\010;\232\273+\270\334c\3629\372\353\3019\324\023.\272\335G\035;\244:\255\267\3646*:C\\\3658lb\360\271`\tU:\007T*\271$\351\221\272J^-:\023\216\3709z$P:V\347\'\272\317}\3778\217#\237\272\376\232\257\271$t\2749I`\000:\243\210q\272<\267\2177`\376)9M\274\377:\230\201\3107H=\031\272\3025\223\272\353\357\326\271ac\201\272wD\007\272k\211f7\227\24739z\370\333\270\026.#;sPr\272\242\206\0048\325S\2609z|\177\271\361\037\202\271\210\004V:\337\351Z:;\251\207:\216\325Z\272\330p\0239\276\260q:\034~\003\272\236J\261\271pd\235:\255\225\223:\013\021c:\356l3:.\367\255\272\032\344\2339%\3642\271g\247\215\270\277\222\0108[Z\352\270k1\2627:\233B:\336\0329:\214Hr\271\372>0\272,\024\2229>\243B\272\341\325\2608\003m\t\272\332I\224\271\341\327\202:\254\263\241:\330\"\003:\347Y\035:\341\'a\272\316B0\272\305\202\3249\331N\350\271\2507\2129h\033S:(\037\0079\322{\301:\374a\2048\r\017\32299\376\214:\177*\037\272\301\226\245:6W\2679\354v;:\232\254\225\272\214\253`9\344A\n:y\027\007: B\3369-\377.\272\215\036\236:x\265\005:\354C\2149\231\327\221\271\"\013\031:z\336\3628\302\207A\272\241\302\006:\006\3055:\377\373p\272\202\275+\272\311\242\221:\372(\030\272\362\271\3737j\201\010:U\3371\272\303\3331:K\211\3259j\010\372\271\000P\241\270\274p%\270Dv\006:*I\t\2725\000\273:7\230\3429\021R]8Ro\221\271\277\276\020\271I\275\200:q9\334\271\303?\235:\252\341\302:\0025Z:>T\032\272[\033\364\266W]I:[3\2349\250\0319:\360\224\37297\357\261:\035\323\0018\317k\":B\265s:\353\032\0308\2377\3309\316\346\2168\234\356H\271\023\020\027:1\307O\271\240@\2179,:\r:\010\236S:\2739o\271\245@8:\324\213*\272P^\306\266\035\252\203\266\222!&\267\r \2635\221\201\3269KIC:\357]\201:\350\220\010:BH\2577.\346]\271\241\332h\272\177\355r\271!}P:\364A09\025A@\272}\341e\272u\213\242:[q\211:\210\026T\270%k?\272\030@S\2707\302\244\272*\332[9\2670\276\271"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected_1/weights"
  input: "global_circle/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_circle/fully_connected/Relu"
  input: "global_circle/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_circle/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
