node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 9
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 9
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\t\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected/weights"
  input: "global_square/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/weights/read"
  op: "Identity"
  input: "global_square/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_square/fully_connected/biases"
  input: "global_square/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/biases/read"
  op: "Identity"
  input: "global_square/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/MatMul"
  op: "MatMul"
  input: "global_square/Placeholder"
  input: "global_square/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_square/fully_connected/MatMul"
  input: "global_square/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_square/fully_connected/Relu"
  op: "Relu"
  input: "global_square/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "/\244\367\271\343VP\272W\303\274:\3658\2139\336\371\n:\270\351_:\370\346\001\273\033-\310:w\231s8\265\024\3279|\177*:k\273\321\271d\\N\271PQ\007:\263\254\236\271\313\0010:K\365?9M*H:^\021\207\271\224:\030:\037\314\232\272\000\226\351\271\214q\2329\200:W9\353\025\271\271\316\033\000\272k\212:\272\350\376\237\272\336\253V:\207\341\256\270\003N$\272\313\016\2129\'\2344\272\034\"D:0\262_\272vG\001\273\317s\005\271\275JG\271<M\'\271\314\371\310:,\035\306:\251\'\211\270\274\251D:sQ&9t61\272\313\034\321\270p-\253\271\023\307\321\271\324\013\025\2709>\306:~\255\210:i/\3529\254o\3709^t*\272\311\203 \2710\274\0179\372#\024:(\016\232\267\000\030v\272T\2120\272\204G\300\272W\277G:\234\310\203:\031\346\361\271)k\271\272p\334\0079\210\270\3079\362\222]9\336\200\240:\367 \214\272\215\351\3259\2346h\271R50\272\020\031S:L\311d8\2216\313\271e\332\022\271\004\325\207\272F;\3218\007\214+\272q\231\222:NA\016\272\357\313\2539\213\264\3439\325\361O\272\230\216\3109\305\026\2129\371SK\272\373p\200\271\226#\260\272\3649V\267~c\n\272\230\353\n:p0\222:\020\3359\272\215\003\245\272\305\334\356:\3437\244\272\214 $\271\007\335\330:\360\310\3069\215,\241\272\302Uf\272mL~9\023\262\203\271\252A :\2736\016\272\365d\2429\342\273\"9\n9g\270m\357\314\272\217\247.9\315\207\361\271\256\371\3677\223/\304\266\036a\312:?\214\226:\303\361z\272\355H\002\272\256\205L\272\363(\257:\206\373\211\270\300\274\202:N\n\227:\314\263\021\272\263\320y\272\005\300F:\200\027\203:\341\023J9\\\226i:\"\357\003:\242\031v:\216\013|\272\2671Y:\03042:\200t\214:\333T&:\223\234\026\272\034\03798\273\205\241:o\2050\272\270C<:\306\033\006;\034LT80\312\207\272\321`&\271\027\305\2609\360\022C\271\376Q\341\271*\371::j{\':\t\255\372:\342\325\250\272\n\231\3338\3556\r: _^\272q\323\004\273l\351\016:\263G\027\272\340g\322\270\312\020^:\363~\270\271\240v\3379\236\273\247\271\262c,\271\030\340\3019d&\307\271\210\301t:\t{j\272\242\274\25281\0176:\272\207r9\355\0302\272#\027D\272\224\300\355\271\362x\233\272\202\363\2478^c\350\271c\376\205:\346\304\3729\276\2743\272+\302\252:\363\350\245\271=\004\341\272E\347\2279\341h\2339i\"V9\220\001\"\272\221\3753\271#\346\361\272\221\246\206:V=\320\271\307Q2\272j\220\023\272\301Z\202\270\310\240\250\272\253\014\002:r\336\2229t<V\272\361\365\2708\211o\337\267\371\367a\272\010\305\003\272\245f#:\202\246Y:\222\005\2349\014\274\314\271U\207\016\272DP\2629\345\323}\272\343\237g\272\311\265\335:\337\r\270\272\312\261\023\272\327)\275:\314Q\274:&\001\353\272\3026k\272\260\243\3659\272&\20598\033\0139\305\223\3369\326y\333:\255\2338\272\252Sh:\214\017\256:g5\1778\2726\227\271V\351\2749\323e49\302oV\271\262f\246\271\363\244\0028\213\247\232\2703~\204:j!\227\272\300ey9y.\233\271\224\021\t\272\305\371L:\257\357\037:X\247\236:\316?\3049A\007g\271\005S\035\273\203\335\356:\231\215\025\271\312:\020\271\224\367K\272V\350\017\272f\205+\272T\220\3079\322\311@:\253\262\220\271\301U\223:\340{l\271\214\000\314:I\223?9A\007\3639\322\363I\272\311\315\005;z\"R:\356\313\r:\373h)\272\223\365y7\221\356\330\271\376\024\241: \270\025\267\263\034\374\271\251\334.7VN\2259\266\325x:\235\035\035\272\372\372?9\002q)\272\377\225\2009\255\002\2269\324b\023\271\373\324\2519\233.\0059\3338\202:\334;Z\272*\235\n\270\340o4\272\375u\014\273 \3669\270BV\214\272|J\2467\3047\2779\005Rb:\306\331\020\272\006\251\000\272O\2523\272\353\370T\272]\203\246\272#\027\3318*k\362\271\023A\303:)\242\2669\361a1:\230\226A\270\257~\354\271\004\377\255:\'g8:F\243\323:\2212\024;\n;0:B\210\000\273_\350\311\271\033\271\234\272\324\023\r:\033\250_\272A\265\240\272\360\277A:5\221\210\272DL\2309\216\270/9\305z$8\031\017\323:\300\234\2209\243|&\272\332#\2238\005+B8\243\010\247\271x\257\2519\2667#\271\\m2:!\256\033:\357\177\0009\2416\2518\374h\3227Z\352\3478\271\207\223:oK\014\272cxM:\351\007\245:9\272\324\271\342s\301\272\2078\214:\335n\317: 7!\272:\342\0059\037\316\3639u!\"\272\022\223\3149\206=R:\t\331\2779\313=\245:\032\374\3259\222\003\231\272\235\324\2147>\035\267:W\203x:\254\2742\272-\013\356\271y\274j\272\022\302\3729\207\034\331\271_\207\325\271\225n\257:f\341\037:\246\257Z\272s\342[\271E\320\270:_\376n:\224\223_\272\247\227\3479B\347\2107\307\307\005:\203\036\252\272\0065\023:\277\010\021:\253\337K9\301\273\r;(o\0379\230\357\013\272\034w\252:\217\255\212:\374\n\263\271v\024)\272\\Z\2629\254\263h:\346\217\276\272wl\216:\333\327*:wP\365\272\307\000\220\271\360\004\3239\265v\016:a\221\021:L\270\336\271\273\005\334\271\253G\177\271-\313p\271\212)\3229\214\200P:\313\211n\272\006\316\204\2728fF\272\205\326$\271\341\211\267\271\006\033\304\272hd\021:7\220\017\272\340x\000:2\031\013\272\324]\2539f\262\252\271\030\207#:\221\245\017\271\365!\037:2v,\267\243!I:\221\254=:\231\344\035\273\'}\206\272R\214\334\271\211\214q9_{g\272\377\022\3349P\014D:\212\271\262\271\327@\260\272\2774\212:\263\325\225\272\355}\3577\245\377w\272\254\231\35162\304E\272\230\367\325\272\215GK:2\260~:0\257\017:\315\202\3779\277k\326:\256\363\'\272\'Tg9\362\260M\272\"\022\313:\3114\272\271\312\215\2239\275\277m\271@\213\333:z\\\252\270K_\253\271\256;s\272\224\025\034:g\031\'7\241%o\271\r\214\313\271\\\347\236\271\276\261\2229\332\252\245:\002\223K9\361o}:\333\326w\270\242Ja8 \\\260:\231\\\2739\221H]\272\336\226\016\272\010\217\003\272\3655\2119.\212p\272\331Y#\267\223\226\2319\250q{:\325\212h\272\177\032D\272\325\224\034:$#\212:\226\026\201\271\003F\302\270\317\242\215\272X5\2729\253\3123\272\260\207x8\345Ny\272\037\235C\272U*\2119\311\231\2309\301\232\325:\357c\010\272\020\305\216\272\241\263N8\007\025\2758\336\305\3019\237\216$\270\330\220S9\205\020k:OV*\272\003\303C:\3235_\272\204\264\002\272u\224\3119b{\204\2728\220\3079L\311Z:\254\'\370\267\315\341\203:\261\255\220\272\250U\204\271Wq\305\270\3236\002\271\227\264\001\272\376\274\204:(\204\3459H\254E:\205=287\177\032\271q\007\203:F\353\2508\206%\t:!\2370\272\207\307B:\265\353\214:\205G\025\271\025\335>:\204 \023\272\t(\247:\003\375@:\2535\037\272\273\035k8r\364\3419\021\201\231:K\346\256:J\236(\272\026\330A:q\203\274\271^\262\25493}\227\271\004A\224\271\350\nc9\330\220%:\013\247,:*\017\221\271\361\006g\2729\']\271\364\362B:\356\331\005\271T\222\020\272\033ze\271q\251\013\271\235\264\370:\246a!\272\341Z.9\250Z\005:\365\327\241:\000\202\r\272a\275V\271n^\r:\347\237\3349\332\237\335\271*\367t:\353\010\334\272s\020~\272X\273;:\310\017\277:e\235\360\272\007\366\\\272\021\367\026:\345/\':\341\3115:\007\030\0319\036\342\211:rf1\272\321\261\201\272.\372\263\271_ \n\272-\247?\2719\333\227:m\227\3059\330\t\270\271\377\253\213:\204\335q:\311_\202:\261\222\032\273\251\031\343\270\347=\303\271\302\206)\271m\206L\272wz\2379\323\202\325\272\262\2045:\222\224\3419cT\334\271b \307:?{\344: \005\307\272D2B\271\026=\370\270:\212\0009\274\20389E\306b:\227\274\323\271\301\232P\271S\342Y9\306$\246\272(\241\"\272\205}U\271"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_1/weights"
  input: "global_square/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_square/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
        tensor_content: "\301\352\004\276XM\017>z~\026=\023\214\036\275\362\270\010=EL\321;\234\2512\275\302f-\274sF\027=$6\021\276\306\235\014\276\":r=\372\376\002\276T\202\014>`\014\347\274 \245\177;\023\324\">\346\376\205=\"\006\300<P\205\266=5\205\027>\365\376\020\276\351Q\222=\202|\255<*\260<=\001\325\323\275\r\235\036\276\256\253\234\274\206f\032<.\331R\275\340(\352\273Z\354\267=\246 \013=\3079\017<\304\260\013=\231p\264\273un\223=\227\375\320\274DO\313\275LK\005\275\005E\334\273N\300\031\275\236\341\005\276c>\024=\035q\215\275\022\347\343=f\321!>\240X\035=s\t\235\275`u\232=q|\236\273\'\2534=/8\031=\321=f\274\247D4\275\342\2632\275I\205\262\275\214[(\276\314\210-= `\323\274\251\306s\275X)3=0I\253<\246\0339=w\221X=\356\240\264\275\227\260\342=\234\215\360<\001\016\031\275\376n\266\275\360<\'<\002{\235=(\'\345\275\246\277\236<F\374P<y\205r\275y\277\247<&)\001\276\327\'\213\2759o\010\2762\251\245\275\260\230\320=\020\365h=-\2253=u\230\n\276\363\347\312=\273>\314=\036P\204=\016PM\2757\243\'=\341\257l\275a\352f\275C\033A=\211?\215\274\363\230\334\275\276\t;<[s\265\275?U\001\275\217\026\236\275]w\204=\351\305\274\275f\210\312=D\327\234=e\333\304=\267\323\232\273\005\300\362<\214\275\'>\306\277{\275\327U\010\276\303\262m\273a*%\276a\254\261\275\223\202\331\274/z\227= \271O=>\203\230=\262R\000\276\305\343\307=\250\236_\275\265>\'\275\n4\026>\201\217\315;{\314\304=\302\373\340\275<:\221=\315\310\030=\324\257\332\275\301\262\300\273[\202\311\275\361\t\016>V\240\177\274\316?\332\273\335\323\302=\234c\212\2752\317\276\275*\270\035=\3274\337\274;td<)\304\021\276\315{\223\275\000\243\270\275`\016\257\275I\006\306<U\301%=o\277\350=\201\3519\276\364i\177\275:\037\004\276\222\366\263\275\312\360T\275"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_2/weights"
  input: "global_square/fully_connected_2/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 11
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\013\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/weights"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/biases"
  input: "global_circle/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/read"
  op: "Identity"
  input: "global_circle/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/MatMul"
  op: "MatMul"
  input: "global_circle/Placeholder"
  input: "global_circle/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_circle/fully_connected/MatMul"
  input: "global_circle/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_circle/fully_connected/Relu"
  op: "Relu"
  input: "global_circle/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\244\017\034:\246$):\357\247\"9r\237\2259\312\301\t\2737 494A\303\271\024\307K:\336>\2529\0139\253:\233M\236\271\240t\275\272\020\274\302:\331\244\225\271\277\240j\272n8\336\271:\260h:R\200v\272\221b\225:\2743\303\271<\225b9\336\305\235\267\335lB\271\362g\2639g\260\003\273{\t\\\270A[\217\272f\362\362\267\357\330\243\270\333g\267\271\007\300\213:\350\0378\271`Jw9\344\247\3346\303fn\271R\374\265\271\235\225\341\272\375-\234:J\263R\2713\221\':0W\035\272O\250\265:\314\211H:\253\343\3038i*v\272\306h\3768\314]\274\272T*\347:\221Tb\271*\237\350:e\376\3219\031;\274\271_\346\3478h\237\007\267\rg\351:\r6Z9\024\304\272\272L\373\243\2713\254\2339jn\2639\276W\026\271\344X\2219\262\345\3109Z\254\224\272\330\036\026\272L\273\025\272#\224\0308\2262\346\271\273\260(9\255\215O\272\314V\t:\315\274\3129\233\310\2679cw\315:\301\264\t:X\253\307\272(\235\031\271\002\361\310\272R\311\311\271j\234\315\266\r\22727\336q\375\270\024H*\272_q\251\272/\003\':\310\337,\272\304)8:\017\003\375\271\204\255\001\272C,f\272b1\310\272;\021\000\273{\027\265\271 \263\2349S\023\302\271 \222\314\270\204g\033\272\212\005w9\3301~\270e\356\340:\346\"G\272\026\037d:\376\316r:\307\302\017\270E\262\2569\253\204/\272\302\201\3209\200Pq8\033\354\2558\347$\032\272\275\n\025\272q\263\225\272\2027\027\271\342\211b8\317\310S:=\205\006:\321.\267:k.:\272D:\3179\265\361u8\373\232)\271^\033\3409\260\311\257\272\243\306^:I\230\0319\321)\177:m\312G\272\256\271\2278!L\316\271\330T\2079\013\022g:y,\3278\0372\2459\316\217H\272\177\177\200\272\316\353\254:\321\020C9W\344\254:\275\010\200\272\376:\253:\310E\261\271o\345\242:\\\023\300\272{\005R\272\001\330.:3\271\276\272v?\317:h\370S\272x~L\271\221\261\273:C7]:\212\332\\\271|\322\3449Af\216\271\244p?8\323+\225:\226H\247\272\tu\035\266\277\201*\272W\333e\272\205\000#:\370(g\272\230]a:\245Z\\8L\277\363:_$\2229\032@\327\272(`\226:\000\332\233\272\347L\3259\374\2776:gLs\271\264\024<\272\0364\242\272\031vX9<\373\001\271(\375\027\272U\335%\272\206\014\226\272A+\341\272\235\001\037:\355d)9\271\003\371\271\"E*:E\010\0246\264\341\315\272!\273-\272\0243[9\253\027m:\3109\3648\025\360\315\271\216\375v\271\212 \252\272P\030\256\266-\034X\271r\t#:\357=`\272hFR:\006\\\3669\207\"\2329\207\340\320:\256;8\272\201\267y\272\237\352{:\303\005 \272mj\025\272?q\2359$)\201:\025\376\2719\036\322\017\272\006\007\2749%\016\257\271b%I8W\234\204:\023c\031\273\177\324q\2728o\022:\005\330\014\2716\253\332\271\3025\r\272h]\211\272\245\3358\272\266\327.\272\'\253\010:\245.l\272\336\241\037\272pG{:\340r\2179\nFe:\022pM9k\'\0239(b\240\272\277^\374\272\014\371\2618\247{:\267[\317\266\272\260\370\246\271\376\320\3459\035\3214:\022.\3728\242m9\272\314\003\341\272\027\222v:)\361-\272\22476:)\325\220:\342I\3109z\3034\272\025@;\271j\023\321\271\021\267W\272n\323\367\2716\027\230\272\257\233\236\271\234D#\270e\304#:\331t\t\272\025\314\2679Xb\2357\270\272p:\t\356j\272\324\332\266\271\212\371\316\272\372\346\214\272\217\356\000\272j\321\343:\202`\026\272\372\246\007\272\202h^:n\251W:\326\247\013:\300\257\2519\300\202\024\272\025N\375\272\013\021G:\267\263(9m>M\272\237\0315:\306\341^\272\001\354\2269F\325\333:\2603\3519\220\220\3449\253\250\221:\005D\\9F\320l\272\377\273\241\272\320\374\025\272\334\366j:\254\220\2139\321d_\272R\264\241\272\'\214a\2727`B\271]J\225\267 U\263\271\267\205\225\272\271\261\337\271\306\031x\271\002@\035\272.t\266\267\205F\27497}\251\2727|\255:8\037N:\010`\3449z\210\2769\317\t\r;\235\305)8\256\2755:\203E\3319\3712s:\226\324\246\271\3465p\271\225]\3279\3426\014\272\227-\353\271\360\344\302:Q\333n\271\321\017\014:+\001\3469{n\027:\207\'\002\272\200\337\025:J\327\365\271rB\3049\354>\005\272\311\000\235:7<\3429\307\032P:;1\21191-F9(\342\236\271\342p\026:\304\266X:%\360\0269\364\017#\272Na\225:\2175\034\272\305e\2466\255]\327:G\355\251\267g\361\352:p\nk:\002\321\365\271#\375\250\270i\304!:\334\241\300\272$\300P:=n\362\271vJ\3679Z\230\247\271\304)v:\036\'\006\270\212\025\2138\025\202Y:\223\337\340\271\006\325\013\2722^\375\267\334\273+\272\341\004\253\270WGT7\2157\216\271\337\211\366\271\340\262\3649\000\340\242\272H\371\200\272j\323\322\272\326\020\017\272`\021P\266A{C\271\334\215\304\271\230\341\2019n\r\3637\200\260\311\271\355\230\34091+\232\272n\034$\272\257\361}9\031}Q:\3176)\271\323V]\272]V\332:t\317\031\271\377f\204:\271&x9\200b\3069Yn{\271z\334J:G7\266\271;\356^:@8\263\271WD\021:@7_\272\002\200\232\272\266U?\272\210\307\233\271\346\213\342\271:\223\345\270\271P!:J\212:\271\221S\316\267\330\276\233\271\035+M:{\201!9R%\244:s\025W\272\230\201a:\333\017\034\272\263\334\364\271\003\235\235\272\n\206\\\272\002\'\2239#\006\353\271|\3410:4C\017;\026\256d\267\231\376\233:TEG\272\306\300*\272\344m\226:\300\353\216:\235\272\373:\034\217\203:\263w\277:\321\3532\272\271\000 :`W\304\272\220\"\254\271\321E\3129\354\202+\272_\024D\272\214\3706\2721\013\234:\201K\316\271\334w\240\271\221\324h\2720K\370:|c1\271U!Y:\017\030\2779\276\306\010\272\244\373\035\2723\205c:I\014\274:\312\032\2178  \001\271$\205%:\316\004\202\271\223+>\270\210Y\246\271\225\216L:\306q\003\272\361\007`\272_\355\300\271\273tf9\303\221D:\207\215R9\031=\2779\024\347\3369\314\316\363\271\373H\233\272\023\200\023\272\210s\271\272\200J\26496\211\303\271l.\3629\000\310W\272t\334\224\272\260\345):[\2404\272\0140G\272E\202\250:^eK\271+\016#\272%,\3229n\341<:\215u1\271\347\022\306\272mx\32386dW\272Z?,\271\236Y\214:\212\303\037:\243\316\320\271\240j&\272m\240\023\272\252\020^:yW%:\016u\271\272\3341\3109\307\352\225:-\306\251\272o_\205\270z\352\247:Fd\':\340WP\272U\344\3108\024\362\230\272\260\375\0179D\213\3746u\347\347:\305\240\275\271\261=>9p\336T:[\335t\267\341\376\202\271\362\022\234\271\232*Z\272\272L\005\272-3\226:\2249\030\271\256\323\356:\031V\257:\273\2335:\nA\037:\004@\254\271\256\275\351\272\2146\2379\312\251\204:\356%\237:Z\357,\271\223\272\2738L1Z\272\031\212\3077\354\224\227:\250d\357:\003-\202\270\354?\024\272UU\022\272\037\034?9qk\223:%\352:\27246,:R( :\376f3\271\375 \t\272\252\022?\270\227<\237:C\264G\267\325\201\3419\315\312\026\272\3646\3549\013J\317\272A\n\263:c\217M:Jl\371\272\004\240[\271\206\326\213:\344\312=\272v8\3139\262\341E\2720#\214\271L\340\205:\220\377\022:\201\201\272\271\317\245\025:\005\024\301\270\256r6:7\372\246\271\362\330\017\272\367\336z:\334\3568:\277\014\3557\"\256\332:\200\275`:\263\377\2149\266u\273:\355\367q:\261\3269\272\000Nk:~\003\024\272{yM\2715\025\2209\205\r?:\331\'\2359K\212\r:\236`\211\272\352\n\027:\355G\0339\211\241\251:z$x\270l\304\010\272;f-8\277\235\245\271\3137\220\270\355\300n\272u\233\3569\226\207W\272*Hn:\347tr:\306\305\t\271N\260\027\271D\231\211\271\246\3413\272\036\220\232:j@_\270pr\027;\322\232N:\227$\234:"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected_1/weights"
  input: "global_circle/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_circle/fully_connected/Relu"
  input: "global_circle/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_circle/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
