node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 9
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 9
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\t\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected/weights"
  input: "global_square/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/weights/read"
  op: "Identity"
  input: "global_square/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_square/fully_connected/biases"
  input: "global_square/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/biases/read"
  op: "Identity"
  input: "global_square/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/MatMul"
  op: "MatMul"
  input: "global_square/Placeholder"
  input: "global_square/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_square/fully_connected/MatMul"
  input: "global_square/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_square/fully_connected/Relu"
  op: "Relu"
  input: "global_square/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\036\000\2259/\022\0009\n\254\206\271\033\272\233\271B\022\23094\272\2329F\202\003;=\007\232:\200\331\016\2729\250U8\265\\^:\364\315S:\331w\375\271\254\267\027\273\034\003\361\272n\330f\272^aO9\032KH\272\270r\215:<\207\232\271\347z\377:us\315\272\313A\20196\224\3449/\222S:\371O\262\271\350\327<\271#G`\271<$\245\272\377\300\010:\017\351\037\271\353Ni7Q:\252\271\201\225\006:\377\027\340\271\2038\371\271\225\304\354\270\246!\345\271\305\227\256:\363\0012:\347\313V:\002\"6\270\013\240,\272\375%\022\271\001m\331\271m\354\2519^\330t\271\355I\357\271\020N\222\272\004\222\2309\006\001\207\272!\212\2319Mq0\272\347\207[\271h0\2329$?\033:V\251\305\272\016\241\245:!\r\360\270\017G\224\270\0245<\270p\266>\272\207\324\304\271&\307\30075\310U\272\343\217\264\271`b\237\272_\273.:\235Q\023:}D\300:\005\236\356:\323^\304\267G\216I\271g\010 \272\347\355\330\272\254z\001\273\342\342*\2726-\356\270Y4\036\272#0\'\271\371*\222\271\007]%\271\320\227\2719\231\2623\272\261\005l\272\005\227{:IuU9\027C\22187X\005\272\301\335\350\270\364\037\r\273\362\366\2249|\227\235\272`J2:\256<\3278\270\263\013:\222\031\250\271\245\215\3107\212\345\2749\275\021\316:\237x\034\2725\013?\272\345\374\322\270\263)w:\031\371\2238\265\362\215\272\374\003\035\271\350\204\3507\337!\204:k\304\271\270\243N,\271\211\322H\272\325\n\007\272\254\016\t\272\2017!:\363\226\027:\371\361\335:\034\311\2369$\224s\272*\212\352\272\333\216-\270s\266\3109\366&\310\271N\"\241\2717\340&:\223:\210:A\251\000\272O\262\306:\313T\3349\030\341\204\272>\2005\272\3346\032\271R\013\260:5\274\3049*\270\0209\031I\2209y\246\2769\347\354K:\365$O9\'\347\211\270R\240\364\271a \202\270!\220\3108\033\245*\270\264{\224:\245\200\3569KYL7\2064\222:\022\354\017:\n\333%:\277\367\3179\241i@:t\210\033\271XS\037\272\217\357\203\270\213\003\262\272Y5\204\272\321`G\272\221\004\263:\276\325\345:!sp8c@\014:y\274\3739h6\2159\221\304\2777\024\316\013\273z\305/:#\240\031\272\201\352\0329lL\374:\275\262\0369\252\237\027:\365[q\272y\321\000:\t\243:9\016\253\347\272&\355\221:&\244Q:\271\221\2038\371p\t\272L\351j:\213\333\332\271\334Tq\271\333\2078:hU\252\272\336\310\3169\371\236$\272\341\325\307\271\255\300\210\270\356O\r;\003\025\272:\30124\272\0040\003;\222\347@\272H\360<\272~|\3409 Kv\272\354\314\3028\td\3349\277\006\2069\013\244\241:\367\313\0049\275l\036:\\\350\231:1m\225\272\277\031a:\326`\227\272\220r\0049\213z\227:\264s\332:BA\030:\374\355;:=\030A\272\200\321\200:\327\234\3438\201\232\2409,P\0109%\234\35297tW\272xT\273\271\357\022U:\266\02078\357I\0329z\221\025\2735\322\2147\347\356[:,\367\031:\025>\3239\367\373,:b\0016:R\n\030:\241\265s\267s \317\270\036n\207\272\370\323\030\267\323&p\271\033\356\314\271\001 \2119`0*:\002\3331:H9K\272\366:\227:hr;9\003e\214:\007l\232\272\003^\3719V\260\203\271(\325\354:OU`\271\240\3743\272\211t\332\270\020\016\325:+S\016\271\363N\0069\332:\37290\004\035:7eX\272\244\365\0309\250\302\273:To\247\271QE\020\2712,\3678\356\005v:K\006(\272\022\225n:vD3\272\001\330k8\200\'\033:\013\217\364:\312\230\251:\251\030(:<\214,\270\204\247\2379\215p\3329p\376\345:\264\312\230:\017\025\021:\307\264\300\271df\2329\205\232\2749\330\322\370\267\274\322R\272\251\336M:\331A\256\271N\210\314:\330\333z\272\370\25309\366\303v:Y\232\225\271\276\337\254:\306\262\':\003\366(\272\232\337\243\272\317\210\275:\275_\006;\323n\037\272t;\n\272\303T\2768=\326\221:d\001\204:*\241I9\255z\244\271\374\005\237\271\347\206\200\270\325>\001;L\236W\271/:\214\271\320E\200:\252I\312\271\343\306}:\0205\213\266pl\270\272WKl\272nvI\272\373\277y9\364\210<\272X\360\222\272\230\227\374\271\rsI:\224%@9\035\216\2347\241\347\031\272v\222\37397\374\261:\350\372G:<\332\002\272\254n\373\272\326H$8,H\2549\216\365\0048\344\205\330\271\017\352\326\272\270\274\2629DP\253:\330-a9.]\3069G\037\274\270\003\234E\271\346(M:\366*\036\272\322\215Z:\363=t\270J4o\271D\232v\272\300\037<9)\243\2329\331\215\276\272\267\303\3358(\277\00788\233;8\034\366\352\270\350i8\272\314\306\213\270\017s\2149\177\313\245:]\314?\272\003\326j:\272:.:t\233\237\271\316\351^\272[\317}8B\366\3168\025\002M:f\220\010:\205\356f\271\251W<\272\362\262\202\270P\340M9\337\352\246\271\356l\230:o\2479\272\0360q:X\315~\272\3126(:q\004\3159\005\275\342\271\367s\3359\340\253!\272\271\267\002\272\226\014_\271\366c\010\272`\305\0359\006a\370\266*\364\240:FZp:! \007\270\245j\303\271\236)\3308\016:\304\272(W\372\271j\327\264\272\276g\242\272\305\nZ\272\375A\223:\333\221\2039\326\n]:\344Hg:\032\227\341\271\004\313\2379\343\024\313\271\315(\204\272\314\304\023;\253\027\023\272\343\227S\272\312\334\n\271$\240%\272c\341\227\272\343\325;\266B\223(\272\241\213t\271\020\300l:\004\363\t8A\220\251\271\0259\216:\004\001\274\272\344W\2729\006\367p9\020\\\032\272MQ\2009\363Ko:\023\213\374:\033;Z\272ZJ\017\272\377\300N:\020\025\243:\344\032\277\272\367\246-\272D\021U:\341\206\200\272`\212\2527\007h\254:i_Z\272B\260b9\030\\E:0\354\332\270\356\323\341\271\026\275\026:L\270\3019\006\003-:\313\213\237:\240\3075\272\372\232\034\272\200\327\2169^~Y:V\351\004\271\335\321\307\271\232\2701:H\'\272:9\274\217\271\266$\3769\225\314\006\272\006\375\2539\017\242\003\272q\224[\272d\325\014:\025-\013;\034\202/\272\236\331\200\271W\236\0329\2230R:\365\016W9\016\224\247\271!L\213\271\343\370\336\271=I\3219F\212\2219\310\374P\271\021r(\272\236\213\"\2721\255\343\271\t\370z\272.\320\033:.\234l:^\000\030;\232C|\272\265\355\242\271\305\3710:\344\201\200\271\247\371\026\271PpV\272\352\037\307:[W\2169\263+?\272-\274i:f:n\272\274\005\2239\000\307\3659\320\222\036\272\351\374\322\267\315\270\221:\n\237\212:B\374\013:v\337|:\3326I:\334\276\250\272\340K\350\271y\327\020\272\331Q\241:\313\025\000;\263\267T:3\315\001:\017\036\004\270\332/\213\272\025\227\000:\270\000N\272j\333\031:b6#\272\356\365S\272\353\022\215:vHw:(\316\202\272\224\202\200\272|\252B\270\355\337\010:<\014$:>\363a9\365\210\036:$\313%:\355\227~\270p\3232\272b\250\001:\360\035\225:\264\264$6!\016\3658\021M\016:\366=@\272\026\202t:\033\3633:;G#:\241V\354\271\013\320\206:\336\206p8\231\031\354\267[X\007:%\023h:\2237M\272\267\000\311\2710\345\177:`\343\0038\357\234\013\272\367\310V9\225\206\304:\271\036\2469,Z\306\272\020\252\275:\024\2427:/$\r\273\375@,:\021In\267\347\336\0219\246\367V9L\215b:u\026\326\272\207\020C9\201\302\205:P\204[:%\331\2309\032Z\233\272.w$:\300\276Z\270r*\223\272\n\3474:\214\202\221:\353\376B\271\036\246\270:`6\300:\353,\356\271`\006\315:yW\263:NR\026\270\026\022\3169\351*\032\272\274\351\233:zz\225\272W\035\252\271at\177:X\31559\n\246A\270\303\'\325\271\034\320e\272\317\027^\2728\347\2068\021\245=\272N\273\2019\336\302Q:\202\335\2519)\301\237\272iR3:\3611\014\2724\341\202:KP\2329\253\036\035\272\333\213\2749\226S\213\271\240C\246:\005\317\327\271E\261\205\267\273\024L:\314\017\260\271\264\002\3449"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_1/weights"
  input: "global_square/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_square/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
        tensor_content: "2\037\277\274\346\245\200=\372\371\337\274\371\261\327\274\310\200w=\005#\017=\205\366\251\275\314\213\257=\202\364\334=p!\336\275Y\225\324\273RS\262=\322\361\332\275\004J\234\275\235\377\262\274r\335O\275<\252\331=\316C\312=\017\353\247\272\341\310\007\275\302\006\244\275\301\237!>[TQ>\222\367 =\265\347J\276\344\307\303=Pe\341\274\226<\327=\262|\236\274ub@\2765\250\262\275\222^q=\034\304\231<O\177\314\275i\'\233=\231y\241\275\356[-<\305\272\276\274\376\305}<\366\210:=\364L\261\275\332;\367\274\244\016\343<Z\342\200\273\372s]\275\277Wh=,\026\331=\257^\261\275\030\365\037\275\306\376\224=P\366#=\367\255\232=\277u!\276W\213\270<=x\237\275\335\2034=\375\210\214=\232\021p\273\037a6;\214\240\324=C\302\022>z\260j=\346\274\241=\"\220m</m\224=\016a\014=\211J\201\275\3401\201=s\231!>@\322\375\274\376u\337<\247\237\002>\210\032:\276\376\373M\275.%\001\276\244\237\355\275\265T{;\036$w=%s\252;\341\273\211\275A\342C=\222\310\355<\021\331\324<v\020\212\275\255\214\203=Q\251\341\2725,\240=\013\215\346<\033\241\302\275\370\342#>\307\340\206\275\357s\361=%7<<\207\314\306<\033u\327:\\\322\340\274\ng\370\274`\326\246\274\255\021\247=Zq\034\275\\Fh\275\231\316\255\275|w\302<\361&\373<c\377\277<\261_m\275C_M=8\365\301\274\307\3460\275\323WE<\304\277<=\177Ee\275^\246\024>6\351|=\260\210r\275\265\032\240<e_H\275F\302e\275\362V8\273T,\275=\307\023{<\001y\230=\275\305\001\276\000\362\266<a\207\026>\321\360\032\275\261\360\224\275\335\200\001>\010\212\231\275~\302\204\275\214%\327<\236X4\275x\315\361\274X\367\277\275\302\n\354<v\271\010=L\216\216=\026\364\226<1\255\007>\305G\224<\251n\005>\210\236.=\257x\222\274\022.\004>\346I\324\275P\0352\2763\333<=tg\004\276q\227Y\276<\2371\276"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_2/weights"
  input: "global_square/fully_connected_2/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 11
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\013\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/weights"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/biases"
  input: "global_circle/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/read"
  op: "Identity"
  input: "global_circle/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/MatMul"
  op: "MatMul"
  input: "global_circle/Placeholder"
  input: "global_circle/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_circle/fully_connected/MatMul"
  input: "global_circle/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_circle/fully_connected/Relu"
  op: "Relu"
  input: "global_circle/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\347\236t9\366\265\315\271\232\020\355:\010\226\3436\215\246\033\272\324\344\204\272\321\217\217\272t :\270;\347|:\314\034\3109\333S):\010\3552\272\376\242\017\272\367\331\001\272]\242%:P\"(\271\032\000\274:LZ\025:\352.\033\272\342-C8R\230\221\272\000\3472:\003\342\033\272\271\240\256:\036\017+9A\264\204\271\355\251\3709\000\340+:\261\304\032:\010{\330\272\037r\352\271\355M\"6A\224\027:m:\317\272m\255l\272d\022(\271\342\273J\272\037e\355\2728\352j:\370\353\032:\205\356\025\272\037\244\214\271\314\334\346\270\362\253\006\272\'\324\025\272\033\255\2179k\372\223:\241_v9\273\277\313\271A\215m\272\305}\":=\354.\272V\332~:\253O\265\271\224\222\325:I\020\023\272L\177\222\272\007@a\272I\234\252\271\033\237;:\036\346\032\272!\036\3029;\204n9\351\302_:\272S\261:r\010B9\016\310\235\272vI+\272\227\2533\272\345\260#:(\247\2279\323!\306\271\014\216\317:\224\026A\2727E\003:\355\001\2019\205\246A\272\344\230\333\271+\363\230\272\346^+\272}Z`\271\204\004\237:i\362I\272%\354a9\225Y\n;l\037\006:\360O\223:l$\216\2666\356\322\272<\305\364\271\'\257\242\271\006{\000:\0352\022\272h\245d\272\177\355\306:\237\200_:\215\371\245\271\223\321F\272\307\034\017:*\326\2548(v\277\271\322^\350\272_\211\334\270s/\211\271,\315\037\272-\005!9\373\340j7=9I:\3060\350\272\t\305,:\326v\215\272\214\240\246\271\254\222f9HAX\272(;\347\270cq.\272\231){9\026\344\3679\255\3743:\322\310\022:\260,\3369\025s\t;\366\210\207\272n\373\243\272\301\035\227\272\336\020\3109Vj\r:\201f\201:\032\335\"9x\241f:}\323\177:\316\370\264\270)\375;9\225A?9\t\233(\272\237\357\203:W\221\2169$\326\003;\312/t\270\321\362K\272\311\276*6~\013\3548\251\346,:\375i \273{\324\211\271\220\246\177:\"S\3509\2602\227\271\023\320T9\005]\0059\235\270z:,\264\r;\373^i:\333>\t\272pF1\272<\306\024\272\356\006\036\272\2330):\227\327\346:\327\272\251:\255Q\013\272\334\210\3679\240\346\033:Ki\200:7\006\246:k\226\3479W\003\2729\272y\2719g\217\014\270\352A\026\272\353r\201\271f}(\272\007v\215\272^\345\3309\2458\363\271\325H_:&\242\267\272\271d2:P\216\242\272\373\001\253\271\236\030@:\rY694Pl:\362{\3779{7\310\271\236\301\305:\021\026\2739\244\034\307\272\\\303\354\272\037i_9\375\277P\272\350\350y:.\305\260:\026~R:)\272\3049\010\304R9\304\264E\270#<2:\253\004\264:\247\034\013:\303\231\27694\254\2108\t\246\274:\'\317\207:\206 ]\272\217,\2159\034\215\261\272\233HH\272\010/\375\266cSp:ku\2429y,X\272\227q\240:\312\245\222\272:\323\230\272De\2249\315\353s\271\203y\010\272\263\212\000:\210\200\225\272\321\003\203\272I\004D9Qs\3769\202L\227\272\256\177*\272\034\020\3079b\227\3378\032\207\300:\344\314\\9B\346\312\271\316/\223:R\354x\272u\256n:\t]\014:\361#\204\272\211\217\3729\250\344\305\271\320Z\270\271\340<\3439\032\307\3538\337\325W\272{?]:\366L79\235A\"9\362\3626:\361\310\017:\026p\304\272\341M\222\272#\336\244\272v\3709:W\217\0379=\376\312:\322Lu\272\275\266\355\271w\237\2329tdC:\272\371v\272\273P\r;\203` 9G\230\3348\3362\2028\364\021\252\270\226\017\202\2723\013;\272\3439\215\270\t\310\263:\221\232\233\2712\345\003\272\347\030\323\270\354\347w\270\252^\207:\345\327\2469Kc\210\272O \301:7\320H\272\031\037\20189\243\3438\335\322\010:\307\213.\271q\323\':\337\307B:%\233\217:91J\270\370\232_8\346\317\033:q\243\320\270cf\2539\356\274\3239\325\250\3429\014\307O9P\307\306\271\363\326\22389\210\224:\266\214\335\271Q\365\335\270\274\344\236\272[\314j:)\311\3149\246\201\2148\334g\"\272\364v\277\272\203\007\360\271$d\3579I2\344:Q\227\261\271\345\337$\272M\271R9\245\354\265:\260\330\255\270\250\225i:\\&,\272FC\211\272\227(\317\271\273\222\200:!n\341\272u\006#:3\375\322\272[zc:\266\254\2019\364\021\221\270<u\310:r\213d9\372fH:\243\014\233:tcY\272\232\007\342\270\233h\2707n*\372\271\272\323\213:\304\261Z:\022\214\201\272\225Y?\272I\230\215:y\364\341:>\274\253\271|_\177\272`\351O\272J\241\254\272@H\3459\\\326\305\272N\366\321\271\313\235\262\271\326\034\t\272\2643\225\271\243\254b\271\273\320\235\270\016E\207:Z\211\3419\220?i:f\213K9\302\243\3459\230\032\2628\216\217\340\270X\340h\271\302\201K\271-j\312\271d\315\224:4\200\"\270\241\'~:\213\301\206\272\361\t\212\272\333\316*9H\257f:\033\353\241:m\341t\272K\245\211:\203\245\013\271=\303$8r\216\0309\232\317\215:\302\331K\271\201~\204\272I\215\323:2\017\245\272(A.\2729\264,:\213Q\3339?\263\2749\303H\225:\003\306\3637\210\204\336\271\025\276\370\272\357=\3109\016_P\272\014a\255:s\274\2309Y\371\2438\025\357\237\270:\217A:\006K\3419\taG\272\201\234K\270\244\335\2339N\272^:\233P\265:\222N\231\2726F\021:\255\312\2129\213z\010\271\235\310e9\343\342P:\010\337\2729\234\024\3319\373\326\321\271\001\030\2557\r\320\330\272\345\214C\271?\315\2129\030\255\2449GY\306\271N\304\263:\364\222\20498;\3666\363\327\231:<\310\216:M\035q:N\367\2509\335\2071\272\304\372\032:\324\236}\272G\372)\272\361\327\010:i\030\237\271[&\316\271\023\217\3728q\305\210\272k\024\2479\244U#:\214+\2009\1779\3418\310\333#\272\342\232#:\327\357S\271lK\245\271c\334\022:\035\326\027:O\266*\272\253)\020\271p`\263\272\374\245$\271\315\353\234\271Y\206\250\271\307\217\216\2726\274\212\272\034\362\207:zE\320\267\221\244F:\347\372\245\2704\033\205\272eP\3128\226I\2459\204\376X\272\345kx\271X\351\250\267\333\205\257:ihN:\261\335\241\272\354\222\264\272\227\310*:I\241\372\270V*\004:\253H\25380Y\2709\320\231A\272\200B\263\272\353\220\2019N\237\260\271F\271\373\267:FD8~[\036:\\\307A\273\265.\002:\001s%:D\304@\272\223\301\257\270?\276{:,\357\2728\307\360_\271\236\001\304\270L3\'\272\365\007\201\272\234qn9\221<\230:Yz#:\250j+\272\227\261\3547M<\016\272L\326\213\271\204\244r\270_+\266\271Am;\272n\255\2209*\202\3749\355\300\344:\"9\022:\333\325\350\272\370\310,9\322\225\235\2726j\277:\367\274\267:D\226\032:\361\245{9\005l\234\272l\275\310:\253\260\026:\210\216j\272\241\375\254:Kh\216:\255\034\2429\200\016\213:S\265\247\272^\242\2778% \220\271N\240\232\272\367e\030\271\236d\020\273\301\216\2579\005\024X:\235\3722:,\347\252\270L\335\251\272\372\035\0228\'\264A:\007\332\254\272N\037\037\271\247\220\2658u\236Z:[\371\232\2718\027\336:\022\260\3248\030\020\2658I\256\205\272\035\261\005\272\017\342h\271\205#\2108\2535\330\271l\327\255\271\203\000\234\272\375\205\013\271\r\354\246\271?\236j\271\243qw8_\032\031:\033\255^9\365\253\33197\3332:vJ\3269\262\247\026\272_ \251\2720\222\031;\345\016\0059]\034|\272Rw\211\271\004\246\241\272\n\033\230:\326\260\203\272pWF\272\347\210s\271\305\247\2379\345\301\207:X\260\3057V\254\207\272\331\366\244\270\313\261k:0\235\300\272Y[M\271\334\\\300\272F$\311\272\355\253S\267\036\206\013:\327\023\006\272CZ\255\271\016\355W\272\313j\260\271\010\201\017:\301i\316\271\355\344\336\271\255K\215\270*\310\3259\002\363J\271i(n:Fx=:\t\221x:\024\020d\271\375]\'\272H\366\203\271\r\016\376\271\302\201=\272\364\373\236\272ov{9\307\331H:h\177\366\271\212[\243:\030\005\361\270\024\217\3129o\374;\272\3314\236\271\300\245w\271y\342(86\3323:"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected_1/weights"
  input: "global_circle/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_circle/fully_connected/Relu"
  input: "global_circle/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_circle/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
