node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 9
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 9
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\t\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected/weights"
  input: "global_square/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/weights/read"
  op: "Identity"
  input: "global_square/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_square/fully_connected/biases"
  input: "global_square/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/biases/read"
  op: "Identity"
  input: "global_square/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/MatMul"
  op: "MatMul"
  input: "global_square/Placeholder"
  input: "global_square/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_square/fully_connected/MatMul"
  input: "global_square/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_square/fully_connected/Relu"
  op: "Relu"
  input: "global_square/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "-\321\226\266\351\016\203\271GW\2647*\001!:\205=\315\271]\207\233\272\327\271\207\272\016r7:\352H\026\272)9\277\270\010uy\2729I\247:7\002Y:\271\245\2417\343\311Q\272w/\304\272\t\023\254\271\276\336j:\261I19\315r\036\271\364\025\365:\267\025\0019\306\236}\272\260k\201\272\017\t\031\272VC\366\271a\317\017:\356\036\3369Q\240v\271E\251A:\356\n\330:+\177\3158ZR\034\271\232n`:\310\006\016\272\2337f\272\226\254f\272\177\207\341\271\n\233\025\271]C\202\271[6\354:X?u\2721\222+\271ri\001:X\341\206:\342I\204:L\237\022\272\214\024\261:\217\270\n9\330\005\2638\312$E\272Bt\0269\270\351T\271*R\236\272\355\270\2349V\245\303\271\275\263\252\272B=\320\271\244\261\256\271\021u\3218\210\247\2648.\334C:\333Aw:&\n\352:j41\272\341!\32598X\2057\254\367\265:\204j!\272O\337\206\272xx\002:5G\2119\001\r\253\271\231d\2679\301\374\3409\342UE\271\240\345\201:\177#\272\272\276\367\026\272\244V\023\272\263\340 :\332\253\247:<\226\3448\201\270K:\241\362\2476wN\213:r^\2039Uu\3409;\263l\267\3610\206\270P\265\253\271\226\206\2219\211\307\350\271\t!\3358*\r\034:\035\301\2679F3\004\272\326\305\2059\n\020\240\272\031\311\2539\016\332n\271\206\2327\272\334f\2759)\270o\271\222\317\034:\032~c9>3\343\267u7\3709\346\260r\272\361\204\211\270\316>\3656&\2018\272\032d58\247\366\345\271\341\'\355\272CbI\272\305\312\2318u\222\034:\247\0202\272\007\346\022\267\004\265\217:\371\013C\270\036\221\316\271\215\306\364:\364\272:\271H8\272\271\370\023\3359\215\364\3359@k\325\272\352\301\006\272\253\251\'\272jl\2539\366\373\r:\230\307\222\272o=\220:?s\360\272PG\237:\005\371\205:z\327\215\271\300\331Y\272\375\351Z:1\002\260\270\301\"\r:\246k\262\271\315\233\3449\331\200P:\023\264\254\271\350\r\212:\'\037\240\271;\351Z\271X\216%\272\215\275\214:\335\\3:\273\210e9q\357\013:\301\355.\273\273\2352\270\'\000\014;\325\275d\272\337\251\033:N\260\002:\355\031T\271\001\022\214:i\000\206\272\253S\273\270\3225\21485\236]:\0260\020:\370\317b:M\310<\272\007\216Z\272\224BK:C\r.\272j\214\026\272\347\375\20192x\331\271gD\210\272Z\224\243\272\257\230\r92\n\020\272\325N\333\267\2143\325\272\034nY\272T~\3078\256)\307\270\2033)\272q\221&\272\014V\005\272\201G99\264\002\2718\317\030c\272.\353m:(\355\2538j\365\214:\034\030\211\271\225\225\303\272\247\316S\271\230\r\223\271\200\213\r:\3751\227:\031\252)\270\350\3040\271%\023\005;\311\210}\271TJ\272\270^\000\307:\nx]\272\216\225 :A\227\211\272|\367o9\222\230\327\271\201o?\272\241\236=:v\330\344\271$\\\2208\033\325\2125\270\312\266:h\001\311\270(C\260\267\2279\2249\200;i\272\336\313\222\270p6\302\270\310\007\235\272\024=\240:J\234\014\271\214j\330\272*\263\024\272\363\241\023\271\354\\`\272F\2469\273\276\032\365\267\020\\\3719\353\201\230:$g\300\271\030\250\2239\007=\244:\221j\036\272\345\rM:\033\246\357\271:\304\232:\370\272\2259\"\222b:u <\272\016\305K9\311!\3669\251\276\030:Ij\2369\005\356#:\377\302\024\272X\252F\271ku\250:\032#W:\325+\2329\274Yw:\004f\2109?V\203\272\371\321\\:\334\231\237:-\220\3626\225\315\026:\243\302R:p\035\2039.\205#;_M\204\271\002hI\272\204\017a\271\202\272\244:\'\000\256:\356$\3039)\356\010:\n\205w8j\355c\272\223EL:\371\030B\271b8\0149L\374(\272\300\025\201\272\303\356\335:b\\\177\271<\273v:\232\016\024:\337\017u\272\r\002&9M\n\026\27252\033;\342\201\000\272\251\361.:\372!f\272\021\345\305\270\361>i\271\272\237\\\267\304/\214:\376\364\3058\314m\342\271D\327\037:X$\235\272L\277\020\273\375\267r:\270P\301\272\317\300f\271\312\200o\266_[\0049\0172\2439\316\037\215:\273\356\264\271\360Q\224\272\302\262\3359\"w\3679\234d\203\2725d\005:2\375\276\271\232H\014:UG\277:Y\257\2079\007>\217\271f\366>\272\353\242=\272\253\225\3627\221\037w9\244\352\314:\022\023=9>\013\014:Yu\3079\373v\316\271\213\324\210:\034\331\220:}G\2169\303m,\272\245\2042:\213\372\307\270\n8Q\272v\213\310\272p\236\266\272\257 \255\271F\031T:\033\226\3049.(k:T|\275\272b\013Z:\010\324\n:\340\370\227:[\242\237:6\315\3439y\300\223\272\314\231\3638\002)\312:\2556\326\272\2004\024\272\260No\272*cx:2qS:\034\364\2548\036\316\216\272\352\307\214\272l\233i\271H\253\2149\221\240\2178\375\242\3569\215Db\272S\203]:\021\n\271\271&=\227\272\253o\257\267\253\007j:\267%\227:\267\037::\263\351\r:\233\301\030:Yt\320\271+\364S\271/>\016:}+c:\253\233L\271R\304\204:\030\022\314\272p\375\331:\255{O:\361o?:\001\242\251:\2028\017\272\261k\262\272\277\026\217:\273Ng\272\255\240\376:\r\231}\270[(b\272\036]\010:\021\307\361\271W\025\016\271\005\020D9P\375\227\270\033xj\272s\200\372\2711\205\0179\207\305\2419\355\240a\270\2100\227:t\016\244\271\360t\242\271PT\253\271\265\216&\272\022\351\3629\251H\2629\344\031\2069B\255q\272\370Ky\272~Wn\272\356\213\304\271e/\221:\324r\340\271\n\314#:\252\0161\2722\364x\272\305Qw\272\006\3346\272\344\362\236\271\376\222\334\270\\\361\3018%\206\2229/\002\013\272\311.(:\036\243=\272\223\373\2359\031\007\337:\245m\305\271\363}&:v\304u\271E\322\301\270F|\317\271+,X\272{t\261:\356\016\034\272\373u/\272\013\266\226:\325\243\214:\316|\022\272h\236\204\271\027\352\274\272\030\266\204\272\377\312\215:\036\300~\272`\336x\272\215\277\242:\240\212q:\303go6\177\257\211\270/\315\r:\222\262\271:\260{K:Y\302C9\324\255&\272z\202;:\344\301c\272T\205\342\271\356)\2769)\r\020:\260*\3729qAj:\321\353^\2720/\027\271\272\224L\272\201H\3257\303Z\363\270\314\325\\:\345\030\224:\276\340\3518\250b\211:G,$\271\031~F:\026&\013\270\277X\220\271\330\270\277\271p\370_:\332\302\305:\007s\237:\013\216\3728F\356\025\270\351[\214:\3564\226\271Eo\215:\312L\376\270\366\216\200\271\032\025\275\271A\r\315:\312\340g:\'#K\271\0246?:YO\024:^\345s\272\311\255\271\2712|\0238\323\344\037:\344\325\3159{\231\242\271\013d(\2713:\025:7p\t;\364}F9\206\270)\272\377\224\003\272{\250\006:\3104\254:\227\272\025\272\352\306k\272\265OK:\230{\2439\027\306\276\272\304\247\252\2712\234\326:Q\306\347\271\240b\274\271\250\035\327\272x\353\202\272\\M\306\271\214\350H\272\374\031\211\272X\331\373\271\010\252\255\272\260%\005\270\340\0055:\267s3\271\374\342\303\272\004\377\307\271\355w?\271\334\256\222\2714\35739\253\372K:\033s\005\273\"\222\345\267\006\223\277\272\256\2276:\025\016\343\271K\035\351\267\032\010n9\207\017\006:P\336[\270\'\022\206\272]\334\236\272\0372\2427\305\324~\271\310\r\2618\3732\026\270\0104z\272+\322\233\270\334\360\247\272\177\206\305\271\350B\276\272w\223\223:\334\032\211:\236\200q\272\217#\212\272i<\266\272L|O\272\203\030v::r/:<\n:\272\300\231G\271\246\212V\272\014\352\002:\361@\236\272\271E,:\035:\2029\201\027\337\272\214G\211\272\321`\370\271\250\245_\271\353\017\205:O\n\360\270 E\2719\273\251\357\272+\t\221\270\265\321\3658\262k(:@\215\344\271#\013\2349\271P\3179\313P\376\271|n,\271\315\rI\272\257\345\217\271\245\352\307:\000N\263\272\035#)\272Q\202I9\372\317\021\2724q\2779\223\315\2239\210\353\3469\266\203v\272{\242\223\272a\220\033:\270\205\2629\314\350\3679\034\275\255858\376\271\270\024\351:\207\027\232:\315m\202:\265\207f\272"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_1/weights"
  input: "global_square/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_square/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
        tensor_content: "\363\351\254\273\014\256\021\275\311rC\2754\336l;\017\273\336\274\216c==\364 \211=\330\224\310=\203\275J=\301fH\2730o\364\275dZ\230\275Tr\336=`a<<r\005\261=\244\214\244<\272\337\">\301\367\360=\204\362\236=\377\\H=\024\360\210\275\364\253\033\275\271:K=b\316\251\275\332\305\033\276Cn\r=\356U,=Fx\370<s*\372<\226{\255=\210\'\006=Wc\306\274\365hR\275\204\0022\276\013\317\021=\255Y\320=\316\265\025\276\006Mj<\237\377\227\275\362\270\254=w\306\277\275\322\240,\275\261\030\021\275\006V\315=\265 \204\271A !\275Z\217M=\276\242\331\275\372H\220=\227\236\207<M\217d=\262\202\301\274\3133\333\275\000\216\002\276\204W\317=\334\313\010\276\304D\340\274\331\354\227\2754g>>;c\263<\025\272\330<\005\004\030\274\240YF=,\037Q\275\355L\t\275\251\262\375=\002S\237<  \025>\371\264\241<\274I\005\275\250\240_=\0248.\275W\225\243=\004\264P\275\002g\240=!\375\021<\260,\226=\324\270\240=\240\"\312\274x\302\227\275\220M\216<\215\213\325=\331\213n=\025\276\275<\303\025Q\276\321\315<<\225\201\277=S\264H\276^{*\275)j\001\276\364\331\"=m\013\251\275\227Q\221\275\327\203\313\275\033\236\265=\304\334*\275\231\277\024=+\204\032>l\024\023=\'\340\326<\306\274(\276\025\207\036\274l1\014=\331\313\252=\030y\360\273od\335=\344x)\276\272\252,\274\004c\337\275\346\"\265\275\206\020U\276\036\311\317\275\352\024\030\2754%\205\275\211qM\275\234B|=MS\221=s\243D=\330\000\211=0\206\370\274\3770\316\274\273\227\213\275p\271\270\275XU\277\275`\226\005\275\257\345\331\275W5\253<(Xm=\317\036\324\274Vu\213=s\231\251\275).\272=\1778\245\274-\363\342<\022\265\t=\035\320\334=\207\273\330<\254\263\301\275\265z\304=\202!h=\225\247`=mX\232=\356q\277\275\304\270\">u\272\327=_\252\305;(\261\271\274\357\372h= V\014>RS\276\275"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_2/weights"
  input: "global_square/fully_connected_2/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 11
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\013\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/weights"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/biases"
  input: "global_circle/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/read"
  op: "Identity"
  input: "global_circle/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/MatMul"
  op: "MatMul"
  input: "global_circle/Placeholder"
  input: "global_circle/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_circle/fully_connected/MatMul"
  input: "global_circle/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_circle/fully_connected/Relu"
  op: "Relu"
  input: "global_circle/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "E\33119\376!\20090\220]\271Xp\240\271\346\3252:>&I\272\372\202\200:\007\354\2178\032u\235\271\236\323\206:F\334^\272\260Tu:f\014\211:\367\036\311\271!\036\t;\304\213 \272\213\227\221\272\340\262D\272\254\236=\271\204n;;\'\312[\270\033l\225\272\030\337\006\271\032s\024\272L!\250:\341\306\316\271\347\227\2159nP\210:\341\337(\272&\260\244\272\250\324\230\272\032\234\325:\351\214\024\272}gq\270\220A\336\270m\3535:R\346\274::u\220\2720\322\\:\"P\0059{\024\237\272\227]F\270\030\262\233:\241\r\271\271\016i\225\270\311&\216\272\327\257\210:\267\302\013\273\304\374g\271\323`\3479\0175\2559N\312\363:\263\242\345:\210\313.\272$<\0009\\d\210\270n\241\2429\237\224\245:\374_\225:\023\032\3179\251\327\033:\276\210\221:\310\277,\272s\217\3648\037.\212\272\251\3508\272Xp#92F\352\265\234O89J\2724\272\007\331W\272\027;\217\270\204\245\0208\332\330,\271U\307\3756e\211\262:\241\235\024\272\303^\r9W\370\264\272Dm\244:j\360u8tT\306\271MP\2458c\312+:\222\300\262:\n:\202:l\231\262\267\253\256\2219<\304\"9\321\233\002\272Q\363\323\272\3062F:\026@Y\271\231\213d\272\340\231\033\272\177\240`\271\037\364\2279\021C\0049D\260\3049\005\356\200:!g\03594p\367:n\201\225:L\246k:~;L9\331\241\2237,\264t\272\350\215\206:D\241\236\272\356>M\272y\356[\272\213\374^7A\332\2159\323\342\246\272B9\020\272L\210\244\270\201\303H\272\037)\032\272\177]\226:\253W\003\270\356R<\272\333\\\221:t\213\360:\313[\006:\305|V:\021\031\375\272\010Q\210\270\373]a\271\024\017\0219\357$\205\272:h\223\270\232[\260\272\363\371\214:\2503\021\272\370\327\211\272\353\337(6\247\tL9\300\276\247\270\323\227\3737\206-\345\271d\331f\272\027[\274\272\355\351\221\271\257\237\000:\272\276\220:\300\373x:ZE\035:\243}\207\272\232\247\000;|\266\025\266\246d\3659>\226\020\272\325\010\005:7\355\0379\305\261V\272O\327X:_\030F\267Y\300\256\272{h\214:q\310\224\272\323\240\323\272\344\351Q:\026r\025\271<pm\272\233\314|:\350\257\2377\377\346\365\271G\205E9\033| 8\014m\262:8\314\2308\266\347\0248.J\263:f\235\231:\332\315\002\271\305\217&:%\377\3549\265\376\204\272>\007\032:\016&\2629\251\017\2549`\255\3769(\241\273\272v\216P\272\206F\31290Dm\270\237\"p\272\234\360\335\272\257(\254:\305p\3219j\000\036:\014\320\013\272\261>\307:\037X\3039\201V\360\271\324\260\3039\264\013Z:\326\2125:\327O\3378\357\222Q\272\240\215E\272\206\202\23498\r\t\270\314\332(\2724\255w:[\002\206\267I\261\0048F\025b\270\351\2406\272\rp\247\272(3\n\272\333T\330\270\333\231d94\346@:N\030\202\272\263:\203\272\313\235291\242\035:\t\014\33290\341%:\335\273\223:\217\310\027:\353\323A\273\321\272\344\272};U\272\352\250\006\271\247\240\3669\242m\3168\240\254C\271\222Xd\271^\224a:\007\224\3209A\211\020\273\003_\232:H\377\253\271\006\0244\273l\255s:\376\007\024:\255?\2469\036\010\2449\006\013\3739\263\326&\272qu!\271\001\324O\2727\365\3728\006\204\037;a:n9\246\013D\272\301\217=\271\246[F\272V5O\270\200X\014:SQc\272t\275\001;\026\262c:\200[B:\345\337\236:r\356\231\271\323\231=\2722%\"\271\232|\027\272\031\220::\224\026\324\271\365\004\3109\270\206\3019X[\276:\004-\223\271/\247|\272\217\270\3449\322\360\267\271\3648\025:\200.\010\272uL\252:D\327I:\350\205o\272\367l\252\271\351\254\001:*-_\271\350\021\301\270~4-:\344\242/:l\373`\272j\301\2439q\001c:\303.\2149\325\27759y\210\356\271\366L\007;*\234t:\362\360\010\272\227!\2569\336\005\033:}\021\034\270\2242\3509\307\345\2179\3641?\272\177\350\261\271\211?\035\272Wj\203:i\255\202:\005f\2428\223\307\2739\314\314\020:\375^\017\271\026l\337:\271\267\217\271\340r\200\272F\343^9\233\th:\336f\3568\354\301\322\271#,M9\"V\264\270\022f+\272\211\217&\271C\227\023\272\3641\234:A\263\3329\030\214;:\310\r\241:\030}\272\271\333G\022\272\373\276C\271\334\215\024\272\201\355\027\272X!\037\272\021c\210\271\010\014\035:\031:G\272a\214;9\302\271\262:,]\263:#\265\213\271\274\023\3519\354\010\3459\272\345\3139\241\351\244:\277\310\3638^\235\3048\366\364\2319\306\247\021\272\336\314z9@\307\3019\271\\\0069\002\32569aM\213::\272K\272\013\255\224\271\371O\003:\2545\0219\205\311b\272#E\3569:\016\231\271\336\303\3468\177\032J\271\242\300;\270y\237\323\272\353\365\255\272\272\210\203\272\314Ei\271UnL9\003\031\0059\271\256\243\271\351?o:\264\373\223\272\240X7:\\7\242:1\216\205:?\211\273:\321\235\235\271\210\236t9h\322k\272bGT\272`\030=\272\232?>\272SK\245:\027\035f:\332\277\321\272\207\347\243\271k\030\251\271Hx.7\315X\217:g\340\300\271sRA\270a\nM:\313\035\275:\221%\215\271\020\303\307\271\010\263D:\201\242\'\272Y\232\016:\331=\3059\230~@\272Js\0209q\326k:\265\230\333\270^?\237\271\332~\351\271\231\013p\272\344\312\270\271\325\357\2249\034\326\335\271;%W\272\000\021I:+i):\241\1773\272\255\036p:\"\337 \271Y\024\2109_?\205\272\213\"\2369d\266\211:\017@\250\272=Zv\272\320z\2029\260\362~8\207\010\016\273\236N\270:\2505\307:\233\310\021\271bP\200\272\303a\37296\310\324:\243\250\227:\325\307\2249\304\306?:]\3057:u\006$\272\344\303\\9>9\2538&L\203:^\351\007:\027E\t\272\027\364D9s#o\272\3744\251\272w\033\0247\246\346,\267\230\371\203:\321\321q:\232\201\363\272\0026+\272r#\231\270\350P^:\235\305\216\2713\373\306\272\272\375\254\272\236\270\r\270\014\002\274\272\353X\2519\335fZ:\024pb\272)\252\2639\351r\202\272\036UN:\235\305\241\271\232\217J\272\202r\213:\031\020E\272KW\231:\354\330\0109y\376\235:\002O\3747m(\3349\010\200\017:\364\033\2129\024\337t:]\200\3728\366\025\3509\261\177(:\370|-:\360\366\3729m\033\343\270\322\014\':![F\272\300&\202\271\226n\250:j\276\3749\3557\3439\254\022\265\272\360g8:\026\20609\255#\021\272\223\3111:ft\2106/&\315\271b\244\010\271%t^\272\261\220\022\272\031\261\024:3g\022\272\351\365:\271u{\307\270Lb\244\272\246\027\331:\372\347K\272\221\335F:\332\237i:~\322\206:\217\244A:\312\324u9\362\360\235\271\334}\3029\267\241o\271\261\343\213:l\212\2279\224`\002:X\307\230\270)\327\226\272\235\337\250:\023\2130\271\236\221\370\271\372\341?:\375e\201\270\355\276\300:\341z\226\271\005\201&\272^\336\3759\212G9:w\007\251:\037\"Z8\341F?:\027\301\002:zs\226\272\234P,9q\024\324\271\320g\001\273\361\016\3259\032\240>\272.\033K\272\207M\027:\004\377\2049(\263\2669\371\002\020:\031\344\207\270fr7\2729\323Q:\373F\"8\200\031-\2722wJ\270\200p\2129\235\371\025\271\353 \022;\\\371n:\235-\246:w\363M\272\016\312/:G\255\227:}\241\366\270+\330\263\271\303O\216\270\312\025\3309\0368d\272i\222\253\271\276@\3139G>\3419\177gq9]+C\270e=\322\270\333lj:b\316\222\2720\240R91\250{\271\010\013e9\215\013\260\271\216\350\220\271\\h|\272\016\324\206\271\251,_:\236z\305\271^\252O:\006>\274:\333\277\037:\013\035C\272\330\0142\270=\320=:1\213\2778sk{9\266\n\2069\301\211\2419\230\333/:\026\227\":*\207\255:\242\035\2149\035\347_\266_x8\271\034-\001:\213\007G9>\366\2349\235\320\202\272\367&\0168\327$\337\271\223\267\036:\262\005\001\273\350\377,7\t\314\033:\364\262\375\270\275\n\344:\366S\271\272\3313\3709"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected_1/weights"
  input: "global_circle/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_circle/fully_connected/Relu"
  input: "global_circle/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_circle/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
