node {
  name: "global_step/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 9
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 9
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\t\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19425716996192932
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_square/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 9
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected/weights"
  input: "global_square/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/weights/read"
  op: "Identity"
  input: "global_square/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 9
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_square/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_square/fully_connected/biases"
  input: "global_square/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected/biases/read"
  op: "Identity"
  input: "global_square/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected/MatMul"
  op: "MatMul"
  input: "global_square/Placeholder"
  input: "global_square/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_square/fully_connected/MatMul"
  input: "global_square/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_square/fully_connected/Relu"
  op: "Relu"
  input: "global_square/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "\2354\2239\021\005\202\272[\262`\272\201\254\2029\1777~:B\3373\272)\362o8\306\"\226:J\010\3659\217R\372\272\343\355\267\271\211a\1779\233\253\226\272\014\331\2017\260[\014:\355\257\247\271\225\337g\270W\340\322:|\024m\272\247VD\272\002K\2609\244\241\000\272\360\035\323\271\301\337\261:\025\364Z:k\031(\272\0025!\271\332+p8\004\013$\272IT\325\271`\360k:\264\254/:\333J-\272\220Z\213\272.\r\021\272\222\337^\270_c\313:\t\234\321\271\372Q\2729O\245\2679\033\364\321:g\021b9\027\335I:\357\275\2435\326\212a\272\256\311A\272\302^\3539@\260\254\272\035\\\032:\261\362\002:\222\370\014\272\375\016.:\315q\224\270z\355\3059\\\212\'\272\347\031\256:\221\340\3426o\251?\272W\355<\272\325\346x\271\252w\r:\033\276O\272\006\315\352\272\254\025\272\272\021\0279\267:\273\245\271\346\r`\271@\210,:4\227\003\267\0316!:\227\362l\272\304\232\220:\020w\3059X\315\203:\'$\276\272t\036\2349S\203.\272f\253\253\272_\036\333\271\205T\252\270\256\325\010\2727ZL\270\352\362\224\271\357\267\025:29\253:1\231\2609\264b%\272\270\3719\272\035\021\027\272S\025\2478Yk\2569\224\316\301\271M\360\227\271Q\335\224\271\375\214A94\"\202:\344\016,9\255Z\3469\373\260\2217iFR\272\321\020F8\244\354\023\272\n\346\272:/\206\207\272\341S\215\271|\t\2619\216\007\2729\217\246\271\271-3K:Ga|:\243\020\"\272b\r&\272\251\2323\271\032}\3149i\311^:}q\3118\016\024\206\2725X\317\272\016;W9\376zt\272\310\021\231:\016\254\3209\232B\2028\251G\037:o[.:[)8:H\310\222\272Z\305\0109\302\032\2409\267\215\2139\213\360J\270\031\r\3378\302\264F\272d\347\320\272q8\242\272gV>:r>\030\272\014\037\271\272L\344\036\271\020^,:\003\364\004:\223d\027\271G\212\256\271\204\276a\272\277\316\304\272 \3462\272\332\360\216\272\261\037\252\272\2244\213: \004\345\264\264\220\003\272;B\004\273\373\312V\272F\010\3049\024@Y9\267\"\364\271\240y\2218A\021J8G\246l9a[\332\266f\277\3079\343\217c\272T\306\n:Z\221\331\270_\006\\\272p\002!:\250\200\2239\327\357 9\312\260[:@O,:\256\357\003:m\240\204:n\275N:\303j\':\222\033\240\272\316{\364\271h\257[\272\245Z\2579\247\031\260:J\264\300:p\235/\271\364&\207:\217 z\271\213\202\006:gy<\272 u\'\272\224\310\234:r* ;\371\330\223\272\313\310\377\271\340\263\264\271<2\277:\213\314t\270\340\362\311:\356v<\272\351\370\244\272$+\2559\031L\346\272\307=f:a\360\3108\212\006\202:\016\023\n:\267e\303\270\346\274\0329M\236\3558\276U\222:\266\272\316\271!>\332\272I\253a:}\242\006\271G\276\004:\255F\213:\321\354\016\272\177Z\3529^,\264\271\2246\376\271\250r\023\272J\177\344\272O\325|\271\351\023\24789\276f\272\340\033-\272\334|\3509\"\263[\272\335\212 ;\327\365\000\272\n\203\3158\371y\203\2711\265;:\240\374\205\2729\335\025:\365\312\3028\354Q\256\271eqz\272!\"U\272|l\337\271u\210\3578\317\236\014\273\265\023\3459\341\"\321\271m7\2469\304\315\303\271\352\343\277\272x\357,\271\244$\251\2710\250\3078\037%\014\273R43\272I\267\000\273\274\017\374\267\275\371c:\273\232\222\272\005W\033:\361\277\007:\347d\n\271\326\265\252\271\245l3:\277\017m\272\324Y\025\272\027\347<:%\362\315:AB\016\271]\206\253\271\3214\3078_\035\034\2719\001\336:|\267\010;\220\351h\272m\203\261\272\316\223\236\272\314\300c\271f@\2029\207E\310\272\232C\244\272[I\2668\030Z\3408\214 \342\271#\322\335\271\333\275\2448&\225Y:\233\321\004\270aE\3519\324\013\211\272Z\262\001:c\266i:p\263~8\353c\333\272\337UX\270\271 g\271P\347\0049\333\342\32392\305S9/#\331\271\213&`\272\345(\201:\351\240\356:\222\365\3336\362FM:\224\001 :t\236\3269\344\022\3669\3712S8\003cl\272\361q\233\271C\256\215:\260K\237\267f.\265\271\006\030\2328\303\2106:A\250\2319\272X)\272\326\275\2227\323\220\312:\035\\\330:{\311\010\27240@\272>\020\013\272O$y9\363<\310\272\306c(\271,\245\256\271\327\026\0138\020\250\3278VT\2709o$\333\271\265\262\1779\320\327\227\272\207\213\0077\\\362\2169\317J\2429U{\3209\367\3475:,\"\245\271j\253\3079\256;9\272+\310M\267\021\361&:\206\263\224\272\036c\2039\032y\2429Z\366\261\272Q\3454\272\213\306\026:H\\\202\272\030\034\311:\367\212\26793\322\004\272\243\030z:<\245;\271\221\303%9\355&\003\273\251n\231:{`\233\271v\344\0029\307\031\247:\017\343\017\267\215\306P:\263\265\002:\312ym\272z\316\034\272\221\321:\272,.\2608Bm=\271\223\351;\272>\257\203\271 o<: UB\271E\264\314\271B\302\327\272K?\020\272t\000\301:\275~\320:\223\370\3419\256\032\002:Mp\2009\266\034\025:\203\307\':\257\256\215\271Os\214\272\305\036\275:\257wO:\\k\202:\365\315\265\266D5\2339\272A\007\272\353\257\263:\017\301T:\263\364\3449\224\274\035:\217\027 :\367us9\013z\265\272\020T\256\2702\332\376:\"\023=\271\245\323\212\272B=09\276V\210\2703x\214\271\362\274F\272MO\245\272/\327\3239O\216\2168;\0267:\363\204\322\271\202t\3579\2161e\272\3713\2548s\025\203:zUf:Q\0217\272v\325T:EY\222\272\201,\013:\\:\2529\272\266\347\271D\224\223:D\204\221\270\225\366\206\271>\200\025\271\234\036\2049v(\340\271\025L\017;\253\364#:5g#9\220\366\201\272\311p\231\272\200\320\r9gv\360:\353\217z:\361\177\242:T3\3419%}P:\272\202\234\272\035nN\272\331\333\016\272\354_\36093\321V\2720e\277\271\005\244\000\272$\214\2108\277p>\271\266\260\010:\027Sc:G=g\272\001\373\342\2716JE:\375V\371\270\363g\2719C\263~:\336\340\211\271\214\212-\272\013P[\266\374k\017\2727o+:\032\240Z8\277\360\245\271]\372\020\271/\250\366\271\261\201\016\272M\322\244\271\025s*\272H[N\271\2670\267:\200X\313\271\304\200\004:\0236J\271\224F\236\272\350\010\254\271\264\357&:\224L\255\270<\036\252:\224.\255:\350\211\2559\2017\3139\330\0049\272\322l\3448\345\020\337\271R\371\312\271\355,\240:{\352\001\270\"H\222\272fR\2169\376\226\210\272M\351\254:\232\023S\267w\03769\004\203\021\272G\370\252:8\272^\272\3078r\272\302\323\337\270u\255\232\271\243<o:V[\022:M\217\223\272\362\344\230\271gT\201:\271\031\235\271\005(\002\272~\301?:u\200Q:|\177\204\272\261\227\214\272\313\005\0057\304\256p8\31069\272PY\n\271\370\253\266\270\310p\003\271\375\320N\270\205r\025\272\310.\2049bGC\272\\\ti\271\025\372\325\270X4\361\271\023O\316\271v\274\3536\3334[\272\337\n\216\272\317\327s:\rHq9\325\367\236\272z\037\26478|\230\2708\301\3748\206\007q:(x\3759u\320\3136L\016\2759\365-/\270\354\361+;\250\211\024;X$\0369\342\323\032;2\312\214\272\216P_\272\243\352\277\272\252\352\352:=hV8\014\250\203\270\277dI\272\255&\235\271\2260\0139\022\205\005:\006\310\204\272\320\235\2007X\276\221\271\032\262>:}N\325:\030w(\272e\240\020:{\320\215\272$*\224:\236\345n\272\207\307\3079\312\210\261:w\313\361:\206\20169e`\304:\350Y\034:\355\244(\272\242\231\025\272\215\375\2048\261\025\'\272\363L\224:\240\\\032\271\340_.\272\317\333\032\271\313\366\236\271\314\273\231:~\344\256\270\325|\212\272\330\326\207\272\244\250X:\233\325&\272#{\202\272\207g\3139\235\306^:\222\224\257\272\346\375k:\227\006\036\271\310\273\305\271Gg8\272{B\234:\261q\330:\332u\225\272\203\316V\270\023a\221\272\273\241\357:\014\266\032\272x\270\226\272\320p\202\271.\\\3729 \013\263\2711\031w:\345/\022\272\326\201N:\372\370F\270"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_1/weights"
  input: "global_square/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_square/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_square/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
        tensor_content: "\323u\367\274A\344\336\274\256f\231\275\352\235\261<\'\r\002\276\233r\005\275\361\250\214\275\242\204\214\275i\353\026=E\332&\276\300;O\275q\004!<\377\206\213\275\\\277\n\275\311u\226\274\355\337\321\274\251-\004>\201\210\277<\257*\246=^\0249>\304\325\004=:\034\007\275dj\r>\034\362@\275\004W`=2\307/\275\236.\342\274qK\220<to\003\275\376]\273=YO\214=\225\313\256<(\366\014=\315\257\026\275\330r\337=\341\351\245=D\345\322\275\376\021\260=\204\206\032>\223\243\241=\207\205\361<\220\325\303=\221#\312\275\234\273\243\274\357\236\345\274\244\2453=H\307\n>\341\026\020=\212\301\304\275\2735\n\275\351~\304\27530\217\274\252\272\361\2747\024\342\275\'M/\275Z\326\215\274\330I\022>Z.\005>\027\273\225>wH\010\275\235W\236\275\231\313\373\275\274\r\036\275A\000\020=\365\215\255<\200D =8E)<\264\303\223\275j\366\212\275\205\251u\273\200\375\227\275\351c\362=\0337\"\275\273-#\275\230qN\276\206C\225\274\264>9<C]\212=\323\372X<a\375\300<\237\310+=\237\220\005>\2577U=\000t\236=.\246\305<}\376\024>\363\245\016>\035\030\364\275\236\200^=\317\243\210\275\203\0327\275\200\rQ<\'<\002=\351\nM\274\213\'D:\327\222(\276\316\277\355\274\0321\026>FH\002\275\226\211\221:\000~\241\275\243\026\223=p\242\237\275\246r\241<Y0\314=\370\270\030=0|\211=\245\2315>\347\010:\275\371\271k=~k\300\275\350B\342=\342\\\340=_\227\005\276\275\220\"\276c\033\023\275\253\007\205\275\246\307\005\276}\340\213\275%c ;\360\001\200=\007\300\230;\370\326\306<\216\304\254<kpv<\360\205\222=\265\316v\275\327\032\223=&\254\323=\030\256)>6\023\343;4\256\035\275\r\355\r\276_\2373\274\033\217\272=c\000\246=N\341\257\274\344\256\341;\301@X\2734&\227<\010\006y\275\005\342&=\004\301\266=\tM\345<\032L\233\275\330\243n\274O\222\023\275\273\377\220=\377\216\002>\022?Q<"
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/Assign"
  op: "Assign"
  input: "global_square/fully_connected_2/weights"
  input: "global_square/fully_connected_2/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_square/fully_connected_2/weights/read"
  op: "Identity"
  input: "global_square/fully_connected_2/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_square/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global_square/fully_connected_2/MatMul"
  op: "MatMul"
  input: "global_square/fully_connected/Relu"
  input: "global_square/fully_connected_2/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/Placeholder"
  op: "Placeholder"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 11
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 11
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\013\000\000\000\226\000\000\000"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.19304683804512024
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  op: "Sub"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/max"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  op: "Mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/RandomUniform"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Initializer/random_uniform"
  op: "Add"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/mul"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 11
        }
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/weights"
  input: "global_circle/fully_connected/weights/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 11
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/biases"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/Assign"
  op: "Assign"
  input: "global_circle/fully_connected/biases"
  input: "global_circle/fully_connected/biases/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected/biases/read"
  op: "Identity"
  input: "global_circle/fully_connected/biases"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected/biases"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected/MatMul"
  op: "MatMul"
  input: "global_circle/Placeholder"
  input: "global_circle/fully_connected/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected/BiasAdd"
  op: "BiasAdd"
  input: "global_circle/fully_connected/MatMul"
  input: "global_circle/fully_connected/biases/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "global_circle/fully_connected/Relu"
  op: "Relu"
  input: "global_circle/fully_connected/BiasAdd"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 150
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
        tensor_content: "vf\'\272\022\376\'9\016\324z90\224?\271\3253\3069]\315\0238M\331\321:\236p\3269\264V\214\272\275\024F\272\211\0165:m\005\2759\270!\260\271\312\030\003\272\332u\3438\372\220\3737\354i%:\252\223\014\272u\354\2768\215x\210\272\252W\263\2728\354v\271q\340\352\271\"%\217:\245\033f:\273;\2267J\200\225\271\351\233\264\272`\312E8\352\177\346\271\330\017U\2726J\226\270]C\247\270 \206\2718\205r\205\267\377\215\230:\034\001\303\266G\027\3149\020\331\377\271\006\362\013:\317\235\351\271i\305\203:<\361\272\271\017\232\\:\ne\234\271\351,\3738\032\351\202:\266\344\225\272\360\311\336:\314\220\213:\333\305\366\272!\026\201:\241[\2519\352\016\233:\022\223\220\270\260O\0229\253\243\2209\305\273\363\271\344\\\331\271\334\344\274\270\035\277V\272\237\255\002\272K7\277\272X1\2759~\361\013\272\3749\2569\350?v\271wd`\272\233\323\n\272\014A\025:$MV9\250\245V\272\226\222\3049\236\207x\272\'\030\2206\366{\232\272x\344T\271\253F\036\272\344\353\225:9\243\2249\0335+\2722H]\271\312f\235:Y\366\2239\356\320$:\253\0260:k\250G\272]\210@\266v\306u:\265mr\271\315S_\272(\006h:\345\363\202\272\362T\013;f\211\001\273!\'\002\272\216\204\320:\223S\217\272\204\031\3719\207\374\2109KP\2139s\340\2759d\347\031:\311\\|:\002\177]\272\214\223G\272\032\350\004:\336\364V\271f<\250:\345\274\024\272\320\275\316\272\274\207\0079\016\247\330:LP`\271\010\r\027\272\272\266\230\272&\305\203\271\346M\232\271\223\377\021;\356\255b\272\351,R:SZ\\84\224\305:-\010\234\271T8o\272f\035\313\271\036T\263\271\316\246\006:M\312\225\271\035\370\306\272\325\363\3268\232F\r\272\272\000\0369\275\010(9\031Y\2218\002\360\235\272\327,\2468\355\021,\271\265\301\2359\223\025\373:\000\260\2308J\226\246\271\027\230\211:\324\352\233:\021\232Z:\257\023\257\272N,\027\272]n!\2725\213\2319o(\2239\315g\2759\245\230\2469\226v(9Z\237\275\272\002K\314\272\260\t\2517B\256\010\272c\265)9\323\245\3109\322G\2448d\007\"\272\226\223\226\272\243\351\2027\204\214\032\270O\2769\272\000\336\257\272Z\357\0139\250\376s:\307kI9-~ \2715\201\005:_$\211\271\375\002\2239\246y\275\272\005\037\377\270\362\257\252\2723X\213:%`\2119\314\300\016\2723V!9\236\333\2017\342\022\373\271\313\336\037\272\024\221\021\272fr\302:\366\017\332\271=\212`:~\227S\2725\371\3758\372\334\306:6\013\261\271S\364e:\270~t:\361%\223\271\372%::h\376l\271\354\263\206:\356\026l\272V\332\241:\252\022#8\231\256\332\271\203\216\357\270\226\347\214:0669\3463\367:\370\244\335\270u\001\223\271\321 \203\270\211\345\307:\342~\010:\257\\\205\270iU\222\272X.\013\272\226}\331\271h\311]\271\355\263\217:~\337\007\272?\203\0169K\373\255\272\'\340\321\272\235\226\3338r\371m9\306m\3749\036\002\010\272\244\rl9\\\2622:\366\306\3369/\310\306:zO\0078\356qt:\200\266\027:n\370\213\271\035aC9-\350\3518\320\263\304\271\250\356\3659\377\035\202\271\224\304\333\2729\337\2639\345\367\3408A\332\003\272{\210\232:$\031\300\271I\313\2078\341\"3:\325\235\3756&\372\2558\366\344\252\270\334\203\200\270:\340\321\271z;\036\272{\327\3339_\003\0229\016p\235\272\247f\346:H\320\023\272.v\013\271m>8:\336\347\301\271\311\036\3478Fe\375994$:E\014\2249\232\026\2409kGq\272\327^\027:\344\274n\2724J\014\272\326m\316\270\271\370\002;d\314\322:u\372\006:e\010\3149T\'y:5n\320\267w\353(:e\023U\270\265\266,:)\242\377\271u\306\t\272~z]\272\317\260\217:|\245x:\204\252G9-\357e:*\014\303\272\326\240\3329g\n\300\271Z\200\304\271\215\'V\272\365\373\026:^\025\377\271\t\007\276\272U\314\331:\365.29x\017\2338W\3026:h\311\302\272\331m8\272\262\313\220\272\310\222\3309$\377\364\271\223\315\3569\3319\255\270L]0:\263\"\210:w\302\2328v0N\271t\246\2109V\001\207\272q\376N:)\363\341:\262\234&9\262SN\272\323d\001\272\2566K\272j\340\271\271\237\306R9F\272y\272\306\022\225:B7Y9\000\240\3728\303\317)\270A\24229MH\3447\036\245\2248\244\016\215:\255\313\003\272Bj\3619\240\333c\272\025\227\343\271<\263H:\326\250Z:\230\"J:\372<\3449\177\013B:\235\263\365\272\264\027\3579\351\207`\272\317\337\2759H\240\235\271\264\371^\272\305\177s\271\315\216\2139\270so\272\360B\224\272V\370\201\272D\214\355\271}\025-9.\315\034\2723\021\007:\220\302\357\271I\227\3568\000\177\200\272\t ~8\356\340\256\272\t\256;\271k\274\257\272.)\3768\245h\2169\3546\3479\355Y}:\313\333\2568\354\"Z\270\371\220\200\271\037\3614:\177/Y:jn\205:\037l\203:2\247\r\272\\1\2439\003\327\004:A;o:*W`9\264\300\257:z\366+\272w\244-\272^|S:B~X\272M\000S99\337*:|dj:\247r\003\271\273\326\032:\242\324\030\272\205\337H9\033?\271\271Q\325\232\272a\273S\272\233\356\0018\353\013]\272\274\025\340\266\300\310\2458\022\024\r\271\230\205G:\334q\343:\243/\331\271T\"\3109\217P\211:$d\246\272\202HD\271?4G\272:\037\252\271\273\354\004:T\316\2379NQ\324:\252\275\027:\323qh\272\032\326\264\271\252\371\3069\321\241\023:\223/\371\272\257V\315\271&\244\227\271\000X\257:H\024\232\270\326H\240\271\336$N\272\"\205\352\271\277\273\026\272\320\361\307\272g\231\036\271\204\014\322:Eo\\:\214A\326:2\222\307:\010.\322\270$X\206\271\254l\210:\227\323\272\272\002)\022:\334\244U\271`\326\265\270n\317\031\272\3528\352\270!\006\204:\222K\177:MZp:\221\250Z9\221U\013\273\301\363\311:\030\21029\370)[94-\022:\206_\321:\003\334\253\271\366\r\r\272;\206M:/\207M:\025\005\201\271\"T\313:X\343\377\271c\357\3328\3435\002\273\234\035\\\272\333\233\026\271\2110:\272b\240q\271E6\013:\241\372X7\200\332\3629;\030\3639\033O\344\2728V\340:\2202-:h\016-\271\316\333U\2722\372\2269\324\2154\272~`\346\270\314>\272\272\211\342\033:)q\n\271\313\317 \270}\230\342\270\027R<\271\017\225\255:P\323\325\271O\274_:\026}\001\273\235\227\236:\373\317\212\271\257oN:#\365 \272[b\341\271\363\274\031:MY\267\271g{e:X9\226\272\353\344\301\271%QR\272\204\274\347:\360%\336\271\374\345\364:cd\2229tn\016:i\257\0009\303s-\271`tg\271\270\325o\272\331\023\007\272(9\351\270s\344N\267\224c/\272\026.\350\272\304\026^:*\014.\272\234\276\034:\343\204\211:\367/\3419\035\262%\272\364\305\2559\314z\230\272T+m9\351C\245\272z\264\247\272l\3006\272\006n\0339x\224.\271 R\211\270%\177\252\272\301\t\003\272\245\221\023\273\363\n\'\2716\251\245:H\264\312\272\3037\3628\016e\206\272M\211q:\353\347D\272;1\227\272i\323]:\324\216s:\026^\274\272\321?\325\271\215\341\211:\0231\324\272\355\"\0378|668\321G\3119h2\322\272\321\354P9G\336\230\272\024\330\2067`\320\222:|\325(\272\231!6:p\262\002\272}v\325\271\235\201\024\272I/\016;\370F_\272\254\313`8\225\263\310:\342\022Y\267\r\363\014\272\032\325\0009]7\360\270\263_\025\272+\236\277:r\354P\272\311\304:\272\"\\\3049J\260\200\270\005k|9(m<9\227cE\272\026U\252:\221?~:0S\2779\311\327\205\271\014\325\316:r\035+\271\007\352-:N\361\203\270DS\000:\014N69\261i\0139\363eW\272\230\203a\272\"`\302\272g\346\3609\334\210\3178\202v\031:\200v\020:\237\031\232:\234N\':\211.\325:;\311\3048\230\344_8#\301\006\272B\206\025\271\026>\345:k\255\304:\234s\014:\261\253M:\230H\326: \325a:\223D\205\272E\332\247\271"
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 150
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/Assign"
  op: "Assign"
  input: "global_circle/fully_connected_1/weights"
  input: "global_circle/fully_connected_1/weights/Initializer/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_circle/fully_connected_1/weights/read"
  op: "Identity"
  input: "global_circle/fully_connected_1/weights"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_1/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_1/MatMul"
  op: "MatMul"
  input: "global_circle/fully_connected/Relu"
  input: "global_circle/fully_connected_1/weights/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global_circle/fully_connected_1/Softmax"
  op: "Softmax"
  input: "global_circle/fully_connected_1/MatMul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
          dim {
            size: 4
          }
        }
      }
    }
  }
}
node {
  name: "global_circle/fully_connected_2/weights/Initializer/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_circle/fully_connected_2/weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 150
